[
  {
    "sectionId": "str-business-strategy",
    "category": "ストラテジ系",
    "chapter": "経営戦略",
    "title": "経営戦略手法",
    "overview": {
      "analogy": "経営戦略とは、旅行の計画を立てることに似ています。まず自分の予算や休暇日数（強み・弱み）を把握し、天気予報や観光地の混雑状況（機会・脅威）を調べてから、どこに行くかを決めますよね。企業も同じように、自社の状況と外部の環境を分析してから、どの事業に力を入れるか、どの市場に進出するかといった戦略を立てます。",
      "summary": "経営戦略手法とは、企業が競争に勝ち、持続的に成長するための分析ツールや考え方のことです。代表的なものにSWOT分析（内部・外部環境の分析）、PPM（製品ポートフォリオ管理）、バランススコアカード（多角的な業績評価）があります。基本情報技術者試験のストラテジ系分野では、これらの手法の概要と適用場面を理解しているかが問われます。"
    },
    "content": [
      {
        "heading": "SWOT分析",
        "body": "SWOT分析は、企業の経営戦略を立てるための最も基本的なフレームワーク（分析の枠組み）です。SWOTとは、Strengths（強み）、Weaknesses（弱み）、Opportunities（機会）、Threats（脅威）の頭文字を取ったものです。強みと弱みは企業の内部環境の分析であり、自社の技術力、ブランド力、人材、財務状況などを評価します。機会と脅威は外部環境の分析であり、市場の動向、競合他社の状況、法律の変更、技術革新などを評価します。例えば、あるパン屋さんがSWOT分析をすると、「強み：地元で50年の歴史がある」「弱み：ネット販売の経験がない」「機会：健康志向パンの需要が増えている」「脅威：近くに大型チェーン店が出店予定」といった整理ができます。これらを組み合わせて、「歴史ある信頼を活かして健康志向パンの新商品を開発する（強み×機会）」といった戦略を導き出します。",
        "diagram": null
      },
      {
        "heading": "PPM（プロダクト・ポートフォリオ・マネジメント）",
        "body": "PPMは、企業が持つ複数の事業や製品を「市場成長率」と「市場占有率（シェア）」の2つの軸で4つに分類し、経営資源の配分を決めるための手法です。ボストン・コンサルティング・グループ（BCG）が提唱したため、BCGマトリクスとも呼ばれます。4つの分類は次の通りです。「花形（スター）」は市場成長率も市場占有率も高い事業で、積極的な投資が必要です。「金のなる木」は市場成長率は低いが市場占有率が高い事業で、安定した利益を生み出す稼ぎ頭です。「問題児」は市場成長率は高いが市場占有率が低い事業で、投資を増やすか撤退するかの判断が必要です。「負け犬」は市場成長率も市場占有率も低い事業で、撤退を検討する対象です。例えば、スマートフォンメーカーが複数の製品ラインを持っている場合、最新のハイエンド機種が「花形」、長年売れている定番機種が「金のなる木」、新しく参入したタブレット事業が「問題児」、売上が落ちている旧型機種が「負け犬」といった分類ができます。",
        "diagram": null
      },
      {
        "heading": "バランススコアカード（BSC）",
        "body": "バランススコアカード（BSC）は、企業の業績を財務面だけでなく、4つの視点からバランスよく評価・管理するための経営管理手法です。4つの視点とは、「財務の視点」「顧客の視点」「業務プロセスの視点」「学習と成長の視点」です。財務の視点は、売上高や利益率など、お金に関する指標で成果を測ります。顧客の視点は、顧客満足度やリピート率など、お客様からどう評価されているかを測ります。業務プロセスの視点は、業務の効率性や品質など、社内の仕事の進め方を評価します。学習と成長の視点は、社員のスキルアップや技術革新など、将来に向けた組織の成長力を評価します。従来は「売上が増えたかどうか」という財務面だけで企業を評価しがちでしたが、BSCを使うことで、「お客様に満足してもらえているか」「社員は成長しているか」といった多角的な視点で経営状態を把握できるようになります。試験では、4つの視点の名称と、各視点に該当する具体的な指標（KPI）を問う問題がよく出題されます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "SWOT分析",
        "definition": "企業の強み（Strengths）、弱み（Weaknesses）、機会（Opportunities）、脅威（Threats）の4つの要素を整理して経営戦略を立案するフレームワーク。",
        "analogy": "就職活動の自己分析に似ています。自分の得意なこと（強み）、苦手なこと（弱み）を振り返り、求人市場の動向（機会）や競争相手の存在（脅威）を分析して、どの企業を受けるか戦略を立てるようなものです。"
      },
      {
        "term": "PPM",
        "definition": "Product Portfolio Managementの略。市場成長率と市場占有率の2軸で事業を「花形」「金のなる木」「問題児」「負け犬」の4象限に分類し、資源配分を決定する手法。",
        "analogy": "家庭の家計管理に例えると、「今は出費が多いけど将来有望な子供の教育費（花形）」「安定して収入をもたらす本業の給料（金のなる木）」「うまくいくかわからないが可能性がある副業（問題児）」「もう利益が出ないのに続けている趣味の教室（負け犬）」のように、お金の使い道を分類して優先順位をつけるイメージです。"
      },
      {
        "term": "バランススコアカード",
        "definition": "財務・顧客・業務プロセス・学習と成長の4つの視点から企業の業績を多角的に評価・管理する経営管理手法。略称はBSC。",
        "analogy": "健康診断に似ています。体重だけ（財務だけ）を見ても健康かどうかはわかりません。血圧（顧客満足度）、内臓の状態（業務プロセス）、運動習慣（学習と成長）も含めて総合的に判断することで、本当の健康状態がわかります。"
      },
      {
        "term": "コアコンピタンス",
        "definition": "他社には真似できない、企業の中核となる独自の強みや能力のこと。長年の蓄積によって培われた技術やノウハウが該当する。",
        "analogy": "料理人の「秘伝のタレ」のようなものです。レシピを公開しても同じ味は出せない、その店だけの特別な味。長年の経験と工夫の積み重ねで生まれた、他の店には真似できない独自の強みです。"
      },
      {
        "term": "ブルーオーシャン戦略",
        "definition": "競争の激しい既存市場（レッドオーシャン）を避け、競争相手のいない新しい市場空間（ブルーオーシャン）を創造して事業を展開する戦略。",
        "analogy": "魚釣りで考えてみてください。みんなが集まっている釣り場（レッドオーシャン）は魚の取り合いになります。それなら、まだ誰も知らない穴場の釣り場（ブルーオーシャン）を見つけて、競争なく悠々と釣りを楽しむほうが賢いですよね。企業も同じ発想で、競争のない新市場を開拓するのがブルーオーシャン戦略です。"
      }
    ],
    "relatedQuestions": ["q-str-001", "q-str-002", "q-str-003", "q-str-004", "q-str-005"],
    "difficulty": "easy"
  }
]
