[
  {
    "sectionId": "strat-corporate-law",
    "category": "ストラテジ系",
    "chapter": "企業と法務",
    "title": "企業活動と法務",
    "overview": {
      "analogy": "企業活動と法務は、お店を開くときに知っておくべき「経営の基本」と「守るべきルール」のセットです。経営の基本は、お店の組織をどう作るか、売上と経費をどう管理するかといったビジネスの土台です。法務は、商品のアイデアを勝手にマネされないようにする権利（知的財産権）や、お客様の個人情報を適切に扱うルール（個人情報保護法）など、ビジネスを安全に行うための法律知識です。",
      "summary": "企業活動と法務は、企業経営の基礎知識と法的知識を扱う分野です。企業の組織構造や会計・財務の基礎、知的財産権（著作権・特許権・商標権）、セキュリティ関連法規（不正アクセス禁止法・個人情報保護法）、国際標準化（ISO・JIS・IEEE）などが含まれます。基本情報技術者試験では、各法律の適用範囲や標準規格の目的について問われます。"
    },
    "content": [
      {
        "heading": "企業活動と経営組織（組織構造、会計・財務の基礎）",
        "body": "企業活動の基本は、「ヒト・モノ・カネ・情報」という4つの経営資源をうまく活用して利益を生み出すことです。家庭にたとえると、家族（ヒト）が持ち物（モノ）とお金（カネ）を使って、スケジュール（情報）を共有しながら生活を営むようなものです。\n\n企業の組織構造にはいくつかの形態があります。「職能別組織」は、営業部・製造部・経理部のように業務の種類ごとに部門を分ける形態で、専門性が高まる一方、部門間の連携が弱くなりがちです。「事業部制組織」は、製品やサービスごとに独立した事業部を設ける形態で、各事業部が独自に判断できるため意思決定が速くなります。「マトリックス組織」は、職能と事業の両方の軸で管理する形態で、柔軟性は高いものの、指揮命令系統が複雑になるデメリットがあります。\n\n会計・財務の基礎知識も試験では重要です。「損益計算書（P/L）」は一定期間の収入と支出をまとめた成績表のようなもので、「いくら稼いでいくら使ったか」がわかります。「貸借対照表（B/S）」は、ある時点での資産・負債・純資産の状態を示す健康診断書のようなものです。\n\n特に重要な概念が「損益分岐点」です。損益分岐点とは、売上と費用がちょうど同じになる（利益がゼロになる）売上高のことです。カフェを経営する場合、家賃や人件費（固定費）を払った上で、コーヒー1杯あたりの材料費（変動費）を差し引いた利益で固定費を回収する必要があります。「コーヒーを1日何杯売れば赤字にならないか」という損益分岐点の計算は、試験でもよく出題される重要な計算問題です。",
        "diagram": null
      },
      {
        "heading": "知的財産権（著作権、特許権、商標権）",
        "body": "知的財産権とは、人間の知的な創作活動から生まれた「アイデアや作品」を保護する権利です。小説を書いたら著作権、新しい発明をしたら特許権、商品のロゴを作ったら商標権というように、知的な成果物を他人に勝手にマネされないようにする仕組みです。\n\n著作権は、文学・音楽・美術・プログラムなどの「著作物」を創作した時点で自動的に発生する権利です。特許権や商標権と違って、役所に届け出る必要がありません（無方式主義）。プログラム（ソースコード）も著作物として保護されますが、プログラムの「アイデア（アルゴリズム）」自体は著作権では保護されない点に注意が必要です。レシピの文章は著作権で守られますが、「卵を先に炒める」という調理法自体は守られないのと同じです。\n\n特許権は、新しい技術的な発明を保護する権利です。著作権と違い、特許庁に出願して審査を受け、登録されて初めて権利が発生します（方式主義）。保護期間は出願日から20年です。実用新案権は、物品の形状や構造に関する考案を保護する権利で、特許ほどの高い新規性は求められません。\n\n商標権は、商品やサービスを区別するためのマーク（ブランドロゴなど）を保護する権利です。商標登録をすることで、他社が同じまたは類似のマークを使うことを禁止できます。コンビニの看板を見れば、どのチェーン店かすぐにわかるのは商標の力です。\n\n試験では「著作権で保護されるものとされないもの」「特許権と著作権の違い」がよく出題されます。特に、プログラムの著作権に関する問題は頻出です。",
        "diagram": null
      },
      {
        "heading": "セキュリティ関連法規（不正アクセス禁止法、個人情報保護法）",
        "body": "IT社会では、情報セキュリティに関する法律の知識が欠かせません。代表的な法律が「不正アクセス禁止法」と「個人情報保護法」です。\n\n不正アクセス禁止法は、他人のIDやパスワードを無断で使ってコンピュータに侵入する行為や、セキュリティの弱点を突いて不正にアクセスする行為を禁止する法律です。たとえば、同僚のパスワードを勝手に使って社内システムにログインしたり、ハッキングで他人のSNSアカウントに侵入したりする行為は、この法律に違反します。他人のIDとパスワードを無断で第三者に教える「不正アクセスを助長する行為」も処罰の対象です。\n\n個人情報保護法は、個人を特定できる情報（氏名、住所、メールアドレスなど）の取り扱いに関するルールを定めた法律です。企業が顧客の個人情報を収集・利用する際には、利用目的を明示し、目的外の使用をしてはいけません。友人の住所録を勝手に業者に売る行為が問題になるように、個人情報は本人の同意なく第三者に提供してはならないのが原則です。\n\nその他にも、サイバーセキュリティ基本法（国のサイバーセキュリティ対策の基本理念を定めた法律）、電子署名法（電子署名に法的効力を認める法律）、特定電子メール法（迷惑メールの送信を規制する法律）なども試験範囲に含まれます。\n\nコンプライアンス（法令遵守）は、企業が法律やルールを守って経営を行うことを意味します。法律違反は企業の信用を大きく損なうため、従業員一人ひとりが法令を理解し遵守する意識が求められます。試験では「不正アクセス禁止法で禁止される行為」「個人情報保護法の対象となる情報」がよく出題されます。",
        "diagram": null
      },
      {
        "heading": "標準化（ISO、JIS、IEEE）",
        "body": "標準化とは、製品やサービスの品質・安全性・互換性を確保するために、共通のルール（規格）を定めることです。身近な例では、電池のサイズが単1～単4で統一されているのは標準化のおかげです。もし各メーカーが独自のサイズで電池を作ったら、リモコンごとに違う電池を探さなければなりません。\n\nISO（International Organization for Standardization：国際標準化機構）は、国際的な標準規格を策定する組織です。IT分野で特に重要なISO規格として、ISO 9001（品質管理の国際規格）、ISO 14001（環境管理の国際規格）、ISO/IEC 27001（情報セキュリティ管理の国際規格）があります。ISO 9001の認証を取得している企業は「品質管理がしっかりしている」と国際的に認められたことを意味します。\n\nJIS（Japanese Industrial Standards：日本産業規格）は、日本の国家規格です。ISOの国際規格を日本向けに翻訳・適用したものも多くあります。JISマークがついた製品は、日本の品質基準をクリアしていることを示しています。スーパーで「JASマーク」のついた食品を選ぶと安心なのと同じイメージです。\n\nIEEE（Institute of Electrical and Electronics Engineers：米国電気電子学会）は、電気・電子分野の技術標準を策定する学会です。IT分野では、IEEE 802.11（無線LAN：Wi-Fi）やIEEE 802.3（有線LAN：イーサネット）などのネットワーク規格が有名です。普段使っている Wi-Fi の仕様は、IEEE が定めた標準規格に基づいています。\n\n試験では「ISO 9001は何の規格か」「IEEE 802.11は何の規格か」といった知識問題が出題されます。各規格の番号と対象分野の対応関係を覚えておくことがポイントです。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "知的財産権",
        "definition": "人間の知的創造活動から生まれた成果を保護する権利の総称。著作権、特許権、実用新案権、意匠権、商標権などが含まれる。",
        "analogy": "自分で考えたレシピやデザインを、他人に勝手にマネされないようにする「盾」のようなもの。創作物の種類によって、著作権・特許権・商標権などの異なる盾を使い分ける。"
      },
      {
        "term": "著作権",
        "definition": "文学・音楽・美術・プログラムなどの著作物を創作した時点で自動的に発生する権利。登録不要（無方式主義）。保護期間は原則として著作者の死後70年。",
        "analogy": "日記を書いた瞬間に自動的に生まれる「その文章は自分のもの」という権利。届け出なくても、書いた時点で著作権が発生する。"
      },
      {
        "term": "特許権",
        "definition": "新規性・進歩性のある技術的な発明を保護する権利。特許庁への出願・審査・登録が必要（方式主義）。保護期間は出願日から20年。",
        "analogy": "新しい調理法を発明して「特許庁に届け出る」ことで得られる権利。届け出ないと保護されないが、登録されれば20年間独占的に使える。"
      },
      {
        "term": "不正アクセス禁止法",
        "definition": "他人のID・パスワードを無断で使用してコンピュータに侵入する行為や、セキュリティの脆弱性を悪用してアクセスする行為を禁止する法律。",
        "analogy": "他人の家の鍵を勝手に使って侵入するのが犯罪であるのと同じ。コンピュータの「鍵」であるパスワードを無断使用する行為も法律で禁止されている。"
      },
      {
        "term": "個人情報保護法",
        "definition": "個人を特定できる情報（氏名、住所、生年月日など）の収集・利用・提供に関するルールを定めた法律。利用目的の明示や本人同意が必要。",
        "analogy": "友人の住所録を勝手に他人に渡してはいけないというルール。個人情報は「預かりもの」であり、本人の許可なく目的外に使ったり第三者に渡したりしてはならない。"
      },
      {
        "term": "ISO",
        "definition": "International Organization for Standardizationの略。国際的な標準規格を策定する組織。ISO 9001（品質）、ISO 14001（環境）、ISO/IEC 27001（情報セキュリティ）などがある。",
        "analogy": "世界共通の「品質お墨付き」を出す組織。ISOの認証を取ることは、国際試験に合格して「この会社の品質管理は世界基準です」と証明されるようなもの。"
      },
      {
        "term": "コンプライアンス",
        "definition": "企業が法令や社会規範を遵守して経営を行うこと。法令違反は企業の信用失墜や罰則につながるため、組織全体で遵守意識を持つことが重要。",
        "analogy": "交通ルールを守って運転するようなもの。スピード違反をすれば罰金や免停になるのと同じで、企業も法律やルールを破れば罰則を受け、社会的信用を失う。"
      },
      {
        "term": "損益分岐点",
        "definition": "売上高と総費用（固定費＋変動費）が等しくなり、利益がちょうどゼロになる売上高のこと。これを超えれば黒字、下回れば赤字となる。",
        "analogy": "カフェで「1日何杯コーヒーを売れば家賃と材料費をまかなえるか」の境目。100杯が損益分岐点なら、101杯目からが利益になる。"
      },
      {
        "term": "OR",
        "definition": "Operations Researchの略。数学的・統計的手法を用いて、経営上の意思決定を最適化する手法。線形計画法、在庫管理モデル、待ち行列理論などが含まれる。",
        "analogy": "「最も効率的な通勤ルートを計算で見つける」ようなもの。経験や勘ではなく、数学の力を使って最も良い選択肢を科学的に導き出す手法。"
      }
    ],
    "relatedQuestions": [
      "q-corp-001",
      "q-corp-002",
      "q-corp-003"
    ],
    "difficulty": "easy"
  }
]