[
  {
    "sectionId": "strat-system-strategy",
    "category": "ストラテジ系",
    "chapter": "システム戦略",
    "title": "システム戦略",
    "overview": {
      "analogy": "システム戦略は、お店の「経営改善計画」にITを活用するようなものです。手書きの帳簿をパソコンに変えたり、電話注文をネット通販に切り替えたりして、業務を効率化し売上を伸ばす計画を立てます。クラウドサービスの活用は、自社ビルを建てる代わりにレンタルオフィスを借りるようなもので、初期費用を抑えつつ必要なときに必要な分だけ使えます。",
      "summary": "システム戦略とは、企業の経営目標を達成するためにITをどのように活用するかを計画・実行する活動です。エンタープライズアーキテクチャ（EA）による全体最適化、BPR・BPMによる業務プロセス改革、SaaSやクラウドコンピューティングなどのソリューション活用が主要なテーマです。基本情報技術者試験では、各概念の定義と具体的な適用場面が問われます。"
    },
    "content": [
      {
        "heading": "情報システム戦略とエンタープライズアーキテクチャ",
        "body": "情報システム戦略とは、企業の経営戦略を実現するために、ITをどう使うかを計画することです。たとえば、「3年後に売上を2倍にする」という経営目標があるなら、「ECサイトを構築してネット販売を始める」「顧客管理システムを導入してリピーターを増やす」といったIT活用計画を立てるのが情報システム戦略です。\n\nエンタープライズアーキテクチャ（EA：Enterprise Architecture）は、組織全体のIT構造を「見える化」して最適化するための設計手法です。大きな会社では、部門ごとにバラバラなシステムが導入されて、データの連携がうまくいかないことがよくあります。EAは、組織全体を鳥の目で見渡して、システム全体の構造を整理・統一する取り組みです。\n\nEAでは、組織を4つの層（ビジネスアーキテクチャ、データアーキテクチャ、アプリケーションアーキテクチャ、テクノロジアーキテクチャ）に分けて分析します。家の設計にたとえると、間取り図（ビジネス）、水道・電気の配管図（データ）、家具の配置図（アプリケーション）、基礎工事の設計図（テクノロジ）のように、それぞれの層を整合性を持って設計します。\n\n情報システム戦略の策定では、現状分析（As-Is）と将来像（To-Be）のギャップを明確にし、そのギャップを埋めるための計画を立てます。ダイエットにたとえると、「現在80kg（As-Is）→目標65kg（To-Be）→15kg減らすための食事・運動計画を立てる」という流れです。試験では、EAの4つの層の名称と役割がよく出題されます。",
        "diagram": null
      },
      {
        "heading": "業務プロセス改革（BPR・BPM）",
        "body": "BPR（Business Process Re-engineering：ビジネスプロセス・リエンジニアリング）とは、既存の業務プロセスをゼロから根本的に見直し、劇的に改善することです。たとえば、紙の申請書を回覧して承認を得ていた業務を、ワークフローシステムに置き換えて瞬時に承認が完了するようにする、といった抜本的な改革がBPRです。\n\nBPRの特徴は「改善」ではなく「改革」である点です。今のやり方を少しずつ良くするのではなく、「そもそもなぜこの作業が必要なのか」と根本から問い直します。引っ越しにたとえると、「部屋の模様替え（改善）」ではなく「もっと便利な場所に引っ越す（改革）」くらいの大きな変化を指します。\n\nBPM（Business Process Management：ビジネスプロセス・マネジメント）は、業務プロセスを継続的に管理・改善していく活動です。BPRが「一度きりの大改革」だとすれば、BPMは「日々の小さな改善の積み重ね」です。PDCAサイクル（計画→実行→評価→改善）を回しながら、業務プロセスを少しずつ最適化していきます。\n\n業務プロセスの分析・設計には、DFD（データフローダイアグラム）やE-R図（エンティティ・リレーションシップ図）などのモデリング手法が使われます。DFDはデータの流れを視覚化した図で、「注文書→受注処理→在庫確認→出荷指示」のようにデータがどこからどこへ流れるかを示します。試験では「BPRとBPMの違い」「BPRの目的」がよく問われるため、両者の特徴を整理して覚えておきましょう。",
        "diagram": null
      },
      {
        "heading": "ソリューションビジネス（SaaS、クラウドコンピューティング）",
        "body": "ソリューションビジネスとは、顧客の課題を解決するためのITサービスや製品を提供するビジネスのことです。「パソコンを1台売る」のではなく、「業務効率を上げるためのシステム一式を提案し、導入・運用までサポートする」という、課題解決型のビジネスモデルです。\n\nクラウドコンピューティングは、インターネット経由でITリソース（サーバー、ストレージ、ソフトウェアなど）を必要な分だけ利用するサービスです。自家用車を持つ代わりにカーシェアリングを利用するようなもので、必要なときだけ使い、使った分だけ料金を払います。初期投資が不要で、すぐに利用を開始できるのが大きなメリットです。\n\nクラウドサービスは提供範囲によって3つに分類されます。SaaS（Software as a Service）はソフトウェアをそのまま利用するサービスで、GmailやMicrosoft 365のようにブラウザから使えるアプリケーションです。PaaS（Platform as a Service）はアプリケーション開発の基盤（プラットフォーム）を提供するサービスで、開発者がプログラムだけ作ればよい環境を提供します。IaaS（Infrastructure as a Service）はサーバーやネットワークなどのインフラを提供するサービスで、自社でハードウェアを購入する代わりに借りて使います。\n\nSOA（Service Oriented Architecture：サービス指向アーキテクチャ）は、システムを「サービス」という部品の組み合わせで構築する設計思想です。レゴブロックのように、独立したサービス部品を組み合わせてシステムを作るため、部品の入れ替えや追加が容易です。試験では「SaaS・PaaS・IaaSの違い」「クラウドのメリット」がよく出題されます。",
        "diagram": null
      },
      {
        "heading": "IT投資評価と活用促進",
        "body": "IT投資評価とは、ITシステムへの投資が経営にどれだけ貢献しているかを評価することです。新しいシステムを導入するには多額の費用がかかるため、「この投資は本当に効果があるのか」を事前に評価し、導入後も効果を測定する必要があります。家電を買うときに「この洗濯機は値段に見合う性能か」を検討するのと同じです。\n\nIT投資の評価では、定量的な指標（コスト削減額、売上増加額など）と定性的な指標（顧客満足度の向上、従業員の負担軽減など）の両方を考慮します。ROI（Return on Investment：投資対効果）は代表的な定量指標で、「投資した金額に対してどれだけのリターン（利益）が得られたか」を示します。\n\nIT投資を検討する際の重要なプロセスが、RFP（Request for Proposal：提案依頼書）の作成です。RFPは、システムを導入したい企業が、ITベンダー（提供者）に対して「こういうシステムが欲しい」という要望をまとめた文書です。引っ越しの見積もりを複数の業者に依頼するときに、「荷物の量はこのくらい、引っ越し先はここ、希望日はこの日」と条件をまとめて伝えるのと同じです。\n\nRFPを受け取ったベンダーは提案書を作成し、発注者は複数の提案を比較して最適なベンダーを選定します。この選定プロセスの前段階として、RFI（Request for Information：情報提供依頼書）でベンダーの基本情報を収集することもあります。試験では「RFPの目的は何か」「RFIとRFPの違いは何か」といった問題がよく出題されます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "EA",
        "definition": "Enterprise Architectureの略。組織全体の業務とシステムを4つの層（ビジネス、データ、アプリケーション、テクノロジ）で整理・最適化する設計手法。",
        "analogy": "会社全体の「設計図面集」のようなもの。間取り図・配管図・電気図・基礎図のように、組織を複数の視点から整理して全体の最適化を図る。"
      },
      {
        "term": "BPR",
        "definition": "Business Process Re-engineeringの略。既存の業務プロセスを根本的に見直し、劇的な改善を図る経営手法。「改善」ではなく「改革」を目指す。",
        "analogy": "部屋の模様替えではなく、もっと便利な場所への引っ越しのようなもの。今のやり方を少し直すのではなく、ゼロからベストな方法を考え直す。"
      },
      {
        "term": "BPM",
        "definition": "Business Process Managementの略。業務プロセスを継続的に管理・改善していく活動。PDCAサイクルを回しながら段階的に最適化を行う。",
        "analogy": "毎日の家事の「やり方改善」のようなもの。洗濯物の干し方を工夫したり、買い物の順序を見直したりして、少しずつ効率を上げていく継続的な取り組み。"
      },
      {
        "term": "SaaS",
        "definition": "Software as a Serviceの略。インターネット経由でソフトウェアを利用するクラウドサービス。利用者はソフトのインストールや管理が不要。",
        "analogy": "CDを買う代わりに音楽配信サービス（Spotify等）を利用するようなもの。ソフトを「買って持つ」のではなく「借りて使う」形態。"
      },
      {
        "term": "PaaS",
        "definition": "Platform as a Serviceの略。アプリケーション開発・実行のためのプラットフォームをクラウドで提供するサービス。開発者はインフラ管理が不要。",
        "analogy": "シェアキッチンのようなもの。調理器具や設備はすべて揃っているので、食材（プログラム）を持ち込めばすぐに料理（アプリ）が作れる。"
      },
      {
        "term": "IaaS",
        "definition": "Infrastructure as a Serviceの略。サーバーやネットワークなどのITインフラをクラウドで提供するサービス。利用者はOS以上の管理を行う。",
        "analogy": "更地の土地を借りるようなもの。土地（インフラ）は用意されているが、建物（OS・アプリ）は自分で建てる必要がある。自由度は高いが手間もかかる。"
      },
      {
        "term": "クラウド",
        "definition": "インターネット経由でITリソース（サーバー、ストレージ、ソフトウェア等）を必要な分だけ利用するサービス形態。初期投資が不要で拡張性が高い。",
        "analogy": "自家用車を持つ代わりにカーシェアリングを使うようなもの。必要なときだけ借りて、使った分だけ払う。駐車場代や車検代も不要。"
      },
      {
        "term": "SOA",
        "definition": "Service Oriented Architectureの略。システムを独立したサービス部品の組み合わせとして構築する設計思想。サービス間は標準的なインターフェースで連携する。",
        "analogy": "レゴブロックでモノを作るようなもの。ブロック（サービス）を自由に組み合わせてシステムを構築し、必要に応じてブロックの入れ替えや追加ができる。"
      },
      {
        "term": "RFP",
        "definition": "Request for Proposalの略。システム導入を検討する企業がITベンダーに対して、要件や条件をまとめて提案を依頼する文書。",
        "analogy": "引っ越しの一括見積もり依頼のようなもの。「荷物の量・引っ越し先・希望日」を伝えて、複数の業者から見積もりと提案をもらう。"
      },
      {
        "term": "SLA",
        "definition": "Service Level Agreementの略。サービスの品質水準（可用性、応答時間など）を数値で定めた合意文書。サービス提供者と利用者の間で締結する。",
        "analogy": "宅配ピザの「30分以内にお届け」という約束のようなもの。サービスの品質を具体的な数値で約束し、守れなかったときのペナルティも定める。"
      }
    ],
    "relatedQuestions": [
      "q-strat-001",
      "q-strat-002",
      "q-strat-003"
    ],
    "difficulty": "medium"
  }
]