[
  {
    "sectionId": "b-algorithms",
    "category": "科目B",
    "chapter": "アルゴリズム",
    "title": "アルゴリズムの基本と応用",
    "overview": {
      "analogy": "アルゴリズムは「問題を解く手順」です。同じ目的地に行くにも、電車・バス・タクシーなど複数のルートがあるように、同じ問題にも複数の解き方があります。どのルートが速いか（効率が良いか）を比較する指標が「計算量（オーダ）」です。科目Bでは、ソートや探索の擬似言語コードをトレースして理解する問題が出題されます。",
      "summary": "科目Bで出題される主要アルゴリズムとして、ソート（バブル・選択・挿入・クイック・マージ）、探索（線形・二分）、再帰を学びます。各アルゴリズムの動作原理と計算量を理解し、擬似言語でのトレースができることが目標です。"
    },
    "content": [
      {
        "heading": "ソートアルゴリズム（バブル・選択・挿入・クイック・マージ）",
        "body": "ソートはデータを順番に並べ替える処理です。バブルソートは隣り合う要素を比較・交換する最も単純な方法で、泡が浮かぶように大きな値が後ろに移動します。計算量はO(n²)で遅いですが、理解しやすいです。選択ソートは、未整列部分から最小値を見つけて先頭と交換する方法です。トランプを手元に並べるとき、一番小さいカードを探して左端に置く作業を繰り返します。挿入ソートは、未整列のデータを整列済み部分の正しい位置に挿入する方法です。手持ちのトランプに新しいカードを差し込む感覚です。少ないデータやほぼ整列済みのデータには効率的です。クイックソートは、基準値（ピボット）を選び、それより小さいグループと大きいグループに分けて再帰的にソートします。平均計算量O(n log n)で高速です。マージソートは、データを半分ずつ分割してからソートし統合する方法です。常にO(n log n)で安定しています。",
        "diagram": null
      },
      {
        "heading": "探索アルゴリズム（線形探索・二分探索）",
        "body": "線形探索は、データを先頭から順に1つずつ調べる方法です。本棚の左端から順番に目的の本を探すイメージです。整列されていないデータでも使えますが、最悪の場合すべてのデータを調べるため計算量はO(n)です。番兵法は、配列の末尾に探索対象の値を追加しておく工夫で、ループの終了条件を簡略化できます。二分探索は、整列済みデータに対して中央の値と比較し、探索範囲を半分ずつ絞り込む方法です。辞書で単語を探すとき、真ん中のページを開いて「前半？後半？」と絞り込むのと同じです。毎回範囲が半分になるため計算量はO(log n)で、1000個のデータでも約10回の比較で見つかります。科目Bでは、これらの探索アルゴリズムの擬似言語コードをステップごとにトレースし、変数の値の変化を追跡する問題が出題されます。",
        "diagram": null
      },
      {
        "heading": "再帰アルゴリズム",
        "body": "再帰とは、関数が自分自身を呼び出す手法です。マトリョーシカ人形のように、大きな問題の中に同じ構造の小さな問題が入っているときに有効です。再帰の2つの要素は、基底条件（これ以上分割しない最小の問題）と再帰ステップ（問題を小さくして自分自身を呼び出す部分）です。階乗の例：factorial(n) は n × factorial(n-1) で、factorial(1) = 1 が基底条件です。フィボナッチ数列：fib(n) = fib(n-1) + fib(n-2) で、fib(0)=0, fib(1)=1 が基底条件です。再帰のトレースでは「呼び出しスタック」を意識することが重要です。factorial(4)はfactorial(3)を呼び、さらにfactorial(2)を呼び…と深くなり、基底条件に達したら順番に結果を返していきます。科目Bでは、再帰関数のトレースが頻出です。呼び出しの順番と戻り値を正確に追跡する練習が必要です。",
        "diagram": null
      },
      {
        "heading": "計算量（O記法）",
        "body": "計算量はアルゴリズムの効率を表す指標で、データ量nに対して処理時間がどう増えるかを示します。O記法（ビッグオー記法）で表し、定数倍や低次の項は省略します。O(1)は定数時間で、データ量に関係なく一定の時間です。配列の添字アクセスがこれに当たります。ロッカーの番号を指定して直接開けるイメージです。O(log n)は対数時間で、二分探索がこれに当たります。辞書で半分ずつ絞り込む方法です。O(n)は線形時間で、データ量に比例して時間が増えます。線形探索がこれです。O(n log n)は効率的なソート（クイック、マージ）の計算量です。O(n²)は二乗時間で、バブルソートや選択ソートがこれです。データが10倍になると100倍遅くなります。O(2ⁿ)は指数時間で、nが増えると爆発的に遅くなります。試験では「どのアルゴリズムがどの計算量か」を問う問題が出題されます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "ソート",
        "definition": "データを昇順または降順に並べ替える処理。様々なアルゴリズムがあり、効率が異なる。",
        "analogy": "トランプのカードを数字の順番に並べ替える作業です。やり方によって速さが全然違います。"
      },
      {
        "term": "バブルソート",
        "definition": "隣り合う要素を比較・交換を繰り返すソート。理解しやすいが遅い。計算量O(n²)。",
        "analogy": "水中の泡が浮かび上がるように、大きな値がゆっくり後ろに移動していきます。"
      },
      {
        "term": "クイックソート",
        "definition": "基準値で分割し再帰的にソートする高速な方法。平均計算量O(n log n)。",
        "analogy": "クラスを身長で2グループに分け、各グループ内でさらに分ける…を繰り返す整列法です。"
      },
      {
        "term": "マージソート",
        "definition": "データを半分ずつ分割してソートし統合する安定な方法。常にO(n log n)。",
        "analogy": "2つの整列済みの山を、1枚ずつ比較しながら1つの山にまとめる作業です。"
      },
      {
        "term": "線形探索",
        "definition": "先頭から順にデータを1つずつ調べる探索方法。計算量O(n)。",
        "analogy": "本棚を左端から1冊ずつ確認して目的の本を探す方法です。"
      },
      {
        "term": "二分探索",
        "definition": "整列済みデータの中央と比較し範囲を半分ずつ絞る高速な探索方法。計算量O(log n)。",
        "analogy": "辞書の真ん中を開いて前半か後半かを判断し、どんどん絞り込む方法です。"
      },
      {
        "term": "再帰",
        "definition": "関数が自分自身を呼び出す手法。基底条件と再帰ステップで構成される。",
        "analogy": "マトリョーシカ人形。大きな人形を開けると中に同じ形の小さな人形があり、一番小さな人形（基底条件）で止まります。"
      },
      {
        "term": "計算量",
        "definition": "アルゴリズムの効率を示す指標。データ量nに対する処理時間の増加傾向をO記法で表す。",
        "analogy": "引っ越し作業の大変さ。荷物が倍になったとき、かかる時間が倍（O(n)）か4倍（O(n²)）かでアルゴリズムの優劣がわかります。"
      },
      {
        "term": "O記法",
        "definition": "ビッグオー記法。アルゴリズムの最悪時の計算量の上界を表す。O(1), O(n), O(n²)など。",
        "analogy": "「最悪の場合どのくらい時間がかかるか」を示す目安。旅行の所要時間で「渋滞がなければ1時間、最悪3時間」の「最悪3時間」がO記法に相当します。"
      }
    ],
    "relatedQuestions": ["q-algo-sort-001", "q-algo-sort-002", "q-algo-sort-003", "q-algo-sort-004"],
    "difficulty": "hard"
  }
]
