[
  {
    "sectionId": "b-programming-basics",
    "category": "科目B",
    "chapter": "プログラミング基礎",
    "title": "プログラミングの基本",
    "overview": {
      "analogy": "プログラミングとは、コンピュータへの「指示書」を書くことです。料理のレシピを書くのと似ています。材料（変数）を用意し、手順（制御構造）に従って調理し、完成品（出力）を得ます。レシピと違うのは、コンピュータは書かれた通りにしか動かないので、1つも手順を省略できないことです。",
      "summary": "プログラミングの基本要素として、変数と型（データの入れ物）、演算子（計算の記号）、制御構造（if/for/while）、関数（処理のまとまり）を学びます。科目Bの擬似言語問題を解くための土台となる知識です。"
    },
    "content": [
      {
        "heading": "変数と型",
        "body": "変数とは、データを入れておく「箱」です。箱には名前を付けて区別します。例えば「age」という名前の箱に「25」という数値を入れるイメージです。擬似言語では「○整数型: age ← 25」のように書きます。型（データ型）は、箱に入れられるデータの種類を指定するものです。整数型は小数点のない数（1, -5, 100など）、実数型は小数点のある数（3.14, -0.5など）、文字型は文字列（\"こんにちは\"など）、論理型は真（true）か偽（false）の2値です。型が違うと計算結果も変わります。整数型の7÷2は3（小数点以下切り捨て）ですが、実数型の7.0÷2.0は3.5になります。代入（←）は箱にデータを入れる操作です。「x ← 10」はxという箱に10を入れること、「x ← x + 1」は今のxの中身に1を足して、また同じ箱に戻すことです。",
        "diagram": null
      },
      {
        "heading": "演算子",
        "body": "演算子は、データに対する「操作の記号」です。算術演算子は四則演算で、+（加算）、-（減算）、×（乗算）、÷（除算）、mod（剰余：割り算の余り）があります。7 mod 3 = 1 は「7÷3の余りは1」という意味です。比較演算子は2つの値を比べて真偽を返します。=（等しい）、≠（等しくない）、>（より大きい）、<（より小さい）、≧（以上）、≦（以下）です。例えば「5 > 3」は真、「5 = 3」は偽です。論理演算子は条件を組み合わせます。AND（かつ：両方真なら真）、OR（または：片方でも真なら真）、NOT（否定：真偽を反転）です。「age ≧ 18 AND age ≦ 65」は18歳以上かつ65歳以下、つまり「現役世代」を表します。演算の優先順位は数学と同じで、掛け算・割り算が足し算・引き算より先です。a + b × c では b × c が先に計算されます。",
        "diagram": null
      },
      {
        "heading": "制御構造（if文・for文・while文）",
        "body": "制御構造は、プログラムの実行の流れを制御する仕組みです。順次（上から順番に実行）、分岐（条件によって異なる処理）、繰り返し（条件を満たす間同じ処理を繰り返す）の3つが基本です。if文（分岐）は「もし〜ならば〜、そうでなければ〜」です。信号機に例えると「もし青ならば渡る、そうでなければ止まる」です。複数の条件を判定するif-elseif-else もあります。for文（繰り返し）は「指定回数だけ繰り返す」です。「iを1からnまで1ずつ増やしながら繰り返す」のように、回数が決まっている場合に使います。毎朝の日課を30日間繰り返すイメージです。while文は「条件が真の間ずっと繰り返す」です。回数が事前にわからない場合に使います。「お湯が沸くまで待つ」のように、条件を満たすまで繰り返します。注意点として、while文で条件が永遠に真のままだと無限ループになり、プログラムが止まらなくなります。",
        "diagram": null
      },
      {
        "heading": "関数の定義と呼び出し",
        "body": "関数とは、まとまった処理に名前を付けて再利用できるようにしたものです。料理で言えば「ホワイトソースの作り方」をレシピカードに書いておき、グラタンでもシチューでも同じカードを参照できるようにすることです。関数は引数（材料）を受け取り、処理を行い、戻り値（完成品）を返します。擬似言語では「○関数名(引数) : 戻り値の型」のように定義します。例えば「○関数 合計(整数型の配列: data, 整数型: n) : 整数型」は、配列dataのn個の要素を受け取り、合計値を整数で返す関数です。関数呼び出しは「result ← 合計(scores, 5)」のように書き、関数が返した値をresultに代入します。関数を使うメリットは、同じ処理を何度も書かなくてよい（再利用性）、処理に名前が付くのでプログラムが読みやすくなる（可読性）、問題の切り分けがしやすい（保守性）です。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "変数",
        "definition": "データを一時的に記憶しておく名前付きの領域。プログラム中で値の代入や参照ができる。",
        "analogy": "名前が書いてある箱。「age」と書いた箱に「25」を入れておけば、後で「ageの中身は？」と聞けば「25」と答えてくれます。"
      },
      {
        "term": "型(整数型・実数型・文字型・論理型)",
        "definition": "変数に格納できるデータの種類を指定するもの。整数型、実数型、文字型、論理型などがある。",
        "analogy": "箱の形。丸い穴には丸いブロック（整数）、四角い穴には四角いブロック（文字列）しか入らない型はめパズルです。"
      },
      {
        "term": "代入",
        "definition": "変数に値を格納する操作。擬似言語では「←」で表す。",
        "analogy": "箱に物を入れる操作。「x ← 10」は「xという箱に10を入れる」こと。前の中身は上書きされます。"
      },
      {
        "term": "演算子",
        "definition": "データに対する演算を表す記号。算術演算子（+, -, ×, ÷）、比較演算子（=, >, <）、論理演算子（AND, OR, NOT）がある。",
        "analogy": "電卓のボタン。＋ボタンは足し算、＞ボタンは大小比較をする道具です。"
      },
      {
        "term": "if文",
        "definition": "条件によって実行する処理を分岐させる制御構造。「もし〜ならば」の構文。",
        "analogy": "分かれ道の標識。「右は東京方面、左は大阪方面」のように、条件に応じて進む道が変わります。"
      },
      {
        "term": "for文",
        "definition": "指定した回数だけ処理を繰り返す制御構造。ループ変数が自動的に増減する。",
        "analogy": "「腕立て伏せ10回！」のように、回数を決めて同じ動作を繰り返します。"
      },
      {
        "term": "while文",
        "definition": "条件が真の間、処理を繰り返す制御構造。回数が事前にわからない場合に使う。",
        "analogy": "「お湯が沸くまで火にかけ続ける」のように、条件を満たすまで繰り返します。"
      },
      {
        "term": "関数",
        "definition": "まとまった処理に名前を付け、引数を受け取り戻り値を返す再利用可能なプログラムの部品。",
        "analogy": "レシピカード。「ホワイトソースの作り方」を1枚のカードにまとめておけば、グラタンでもシチューでも使い回せます。"
      },
      {
        "term": "引数",
        "definition": "関数に渡す入力値。関数内でこの値を使って処理を行う。",
        "analogy": "レシピの「材料」。ホワイトソースの関数に「バター50g、小麦粉50g、牛乳500ml」を渡すイメージです。"
      },
      {
        "term": "戻り値",
        "definition": "関数が処理結果として呼び出し元に返す値。",
        "analogy": "レシピの「完成品」。ホワイトソースの関数が「できあがったホワイトソース」を返してくれます。"
      }
    ],
    "relatedQuestions": ["q-trace-001", "q-trace-002", "q-trace-003", "q-trace-004", "q-trace-005"],
    "difficulty": "medium"
  }
]
