[
  {
    "sectionId": "b-pseudo-language",
    "category": "科目B",
    "chapter": "擬似言語",
    "title": "擬似言語の読み方とトレース技法",
    "overview": {
      "analogy": "擬似言語は、基本情報技術者試験で使われる「架空のプログラミング言語」です。特定のプログラミング言語（PythonやJavaなど）ではなく、誰でも読めるように日本語混じりで書かれた「万国共通の設計図」のようなものです。この設計図を1ステップずつ手で実行（トレース）する技術を身につければ、科目Bの大半の問題を解けるようになります。",
      "summary": "FE試験の擬似言語は独自の文法を持っています。変数宣言、代入、条件分岐、繰り返し、関数定義などの基本文法を理解し、コードを1行ずつ手動で実行する「トレース技法」を習得することが科目B攻略の鍵です。"
    },
    "content": [
      {
        "heading": "FE試験の擬似言語文法ルール",
        "body": "擬似言語には決まった書き方があります。変数宣言は「○型名: 変数名」です。例えば「○整数型: count」は整数型の変数countを宣言します。配列は「○整数型の配列: data = {1, 2, 3}」と書きます。代入は「←」を使い、「x ← 10」でxに10を格納します。条件分岐は「もし 条件 ならば〜そうでなければ〜を実行する」です。繰り返しは「○○ を △△ から □□ まで 1 ずつ増やしながら繰り返す〜を繰り返す」（for文）と「○○ の間繰り返す〜を繰り返す」（while文）があります。関数定義は「○関数名(引数) : 戻り値の型」で、「return 値」で戻り値を返します。手続き（戻り値なしの関数）は「○手続き名(引数)」と書きます。配列の添字は0から始まります。",
        "diagram": null
      },
      {
        "heading": "トレース表の作り方",
        "body": "トレースとは、プログラムを1行ずつ手動で実行し、変数の値の変化を追跡することです。トレース表は、各ステップでの変数の値を一覧にした表です。作り方の手順は以下の通りです。まず、プログラムに登場するすべての変数を列として書き出します。次に、プログラムを1行ずつ上から順に実行し、変数の値が変わるたびに新しい行を追加して値を記録します。条件分岐では、条件式を実際に評価して、真（true）ならば「ならば」側、偽（false）ならば「そうでなければ」側を実行します。繰り返しでは、ループ変数の値と条件の真偽を毎回確認します。関数呼び出しがある場合は、呼び出し先の関数のトレースを別に行い、戻り値を呼び出し元に戻します。トレース表は「計算ミスを防ぐ最強の武器」です。頭の中だけで追跡するとミスしやすいので、必ず紙に書くことが大切です。",
        "diagram": null
      },
      {
        "heading": "よくある出題パターン",
        "body": "科目Bの擬似言語問題には典型的な出題パターンがあります。パターン1：単純な計算トレース。変数への代入と四則演算を順に追跡する問題です。演算子の優先順位に注意が必要です。パターン2：条件分岐のトレース。if文の条件が真か偽かを正確に判定し、正しい分岐を追う問題です。パターン3：ループのトレース。for文やwhile文でループ変数がどう変化するかを追跡する問題です。ループの回数と終了条件に注意です。パターン4：配列操作。配列の要素のアクセス、走査、並べ替え、検索を行うプログラムのトレースです。添字が0始まりであることに注意です。パターン5：関数呼び出し・再帰。関数に引数を渡して戻り値を受け取る処理、再帰関数の呼び出し順序を追跡する問題です。パターン6：データ構造操作。スタック、キュー、リスト、木などのデータ構造を操作するプログラムのトレースです。",
        "diagram": null
      },
      {
        "heading": "トレースのコツと注意点",
        "body": "効率的にトレースするためのコツをお伝えします。コツ1：変数は必ず表にする。頭の中だけでなく、紙にトレース表を書きましょう。変数が多い問題ほど効果的です。コツ2：添字に印をつける。配列操作では、現在参照している添字にマーカーで印をつけると、参照位置を見失いにくくなります。コツ3：ループは何回目かを数える。ループ変数の値を毎回記録し、「今何周目か」を意識しましょう。コツ4：条件式は必ず評価する。「明らかにtrue」と思い込まず、毎回実際の値を代入して確認しましょう。注意点1：代入の方向。「x ← y」はyの値をxに入れることで、yは変わりません。注意点2：整数の除算。整数型同士の割り算では小数点以下が切り捨てられます（7÷2=3）。注意点3：配列の範囲外。要素数5の配列の有効な添字は0〜4です。注意点4：ループの境界。「iを0からn-1まで」と「iを0からnまで」ではループ回数が1回違います。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "擬似言語",
        "definition": "基本情報技術者試験で使用される、特定のプログラミング言語に依存しない試験用の記述言語。",
        "analogy": "料理のレシピを書くための「共通フォーマット」。和食でも洋食でも同じ書式で書けるルールブックです。"
      },
      {
        "term": "トレース表",
        "definition": "プログラムの各ステップでの変数の値を記録した表。手動でプログラムを実行する際の必須ツール。",
        "analogy": "家計簿のようなもの。お金（変数）の出入り（変化）を1件ずつ記録して、今いくらあるか把握します。"
      },
      {
        "term": "変数の追跡",
        "definition": "プログラムの実行に伴い、各変数の値がどのように変化するかを記録すること。",
        "analogy": "マラソン選手のGPS追跡。各チェックポイント（ステップ）での位置（変数の値）を記録していきます。"
      },
      {
        "term": "ループの展開",
        "definition": "繰り返し構造を1回ずつ展開し、各反復での処理と変数の変化を明示的に追跡すること。",
        "analogy": "スプリングを伸ばして直線にするイメージ。くるくる回る繰り返しを、1回ずつ一直線に並べて見やすくします。"
      },
      {
        "term": "再帰の展開",
        "definition": "再帰関数の呼び出しを、基底条件に達するまで1段ずつ展開して追跡すること。",
        "analogy": "マトリョーシカを1つずつ開けていく作業。一番小さな人形（基底条件）が見つかったら、順番に閉じて（戻り値を返して）いきます。"
      },
      {
        "term": "手続き",
        "definition": "戻り値を持たない関数（サブルーチン）。処理を実行するが値は返さない。",
        "analogy": "「部屋を掃除する」という作業指示。作業自体を行うが、何かを返すわけではありません。"
      },
      {
        "term": "関数呼び出し",
        "definition": "プログラムの実行中に別の関数を呼び出し、その結果（戻り値）を受け取ること。",
        "analogy": "料理中に「ホワイトソースを作って」と別のシェフにお願いし、できあがったソースを受け取る操作です。"
      }
    ],
    "relatedQuestions": ["q-trace-001", "q-trace-005", "q-trace-010", "q-trace-017", "q-trace-020"],
    "difficulty": "medium"
  }
]
