[
  {
    "sectionId": "b-security",
    "category": "科目B",
    "chapter": "情報セキュリティ",
    "title": "科目Bの情報セキュリティ",
    "overview": {
      "analogy": "科目Bの情報セキュリティは、「デジタルの世界の防犯対策」を学ぶ分野です。家の鍵（暗号化）、身分証明書（認証）、セキュリティカメラ（監視）のように、情報を守るための技術と考え方を身につけます。サイバー攻撃は泥棒の手口のようなもので、手口を知ることで効果的な対策ができます。",
      "summary": "科目Bの情報セキュリティでは、暗号化技術（共通鍵・公開鍵）、認証技術（パスワード・生体認証・多要素認証）、アクセス制御、代表的な攻撃手法（SQLインジェクション、XSS、フィッシング等）と対策を学びます。"
    },
    "content": [
      {
        "heading": "暗号化技術（共通鍵・公開鍵）",
        "body": "暗号化とは、データを第三者に読めない形に変換する技術です。手紙を特殊なインクで書いて、専用のライトを当てないと読めなくするイメージです。共通鍵暗号は、暗号化と復号に同じ鍵を使う方式です。家の鍵と同じで、送る側も受け取る側も同じ鍵を持ちます。処理が高速ですが、鍵をどうやって安全に相手に渡すか（鍵配送問題）が課題です。代表的な方式にAESがあります。公開鍵暗号は、暗号化用の鍵（公開鍵）と復号用の鍵（秘密鍵）が別々の方式です。南京錠に例えると、公開鍵は開いた南京錠（誰でもロックできる）、秘密鍵は南京錠の鍵（持ち主だけが開けられる）です。鍵配送問題を解決しますが処理は遅いです。RSAが代表的です。実際の通信では、ハイブリッド方式（公開鍵暗号で共通鍵を安全に交換し、実際のデータは高速な共通鍵暗号で暗号化）が使われます。SSL/TLSがこの方式です。",
        "diagram": null
      },
      {
        "heading": "認証技術（パスワード・生体認証・多要素認証）",
        "body": "認証とは「あなたは本当に本人ですか？」を確認する技術です。認証の要素は3つあります。知識認証（Something you know）はパスワードや暗証番号など「知っているもの」です。所有認証（Something you have）はICカードやスマートフォンなど「持っているもの」です。生体認証（Something you are）は指紋や顔など「身体の特徴」です。多要素認証（MFA）は、これら異なる種類の要素を2つ以上組み合わせて認証する方式です。ATMでは暗証番号（知識）＋キャッシュカード（所有）の2要素認証を行っています。スマホのロック解除では顔認証（生体）＋パスコード（知識）を使う場合があります。パスワードだけの認証は、パスワードが漏洩すると突破されてしまうため、多要素認証が推奨されています。ディジタル署名は公開鍵暗号の応用で、送信者が秘密鍵で署名し、受信者が公開鍵で検証することで、なりすましと改ざんを防ぎます。",
        "diagram": null
      },
      {
        "heading": "アクセス制御",
        "body": "アクセス制御とは、情報やシステムに「誰が」「何を」できるかを管理する仕組みです。会社のオフィスに例えると、受付（認証）を通過した後、各部屋への入室権限（認可）が人ごとに異なるイメージです。社長は全室入れるが、新入社員は自分のフロアだけ、という具合です。任意アクセス制御（DAC）は、データの所有者が他のユーザーへのアクセス権を設定する方式です。自分のファイルを「閲覧のみ」「編集可」などと設定できるGoogleドキュメントの共有設定がこれに近いです。強制アクセス制御（MAC）は、システム管理者がセキュリティレベルに基づいてアクセス権を設定する方式で、軍や政府機関で使われます。ロールベースアクセス制御（RBAC）は、役割（ロール）に基づいてアクセス権を付与する方式で、「経理部」という役割のメンバーは経理システムにアクセスできる、という形で管理します。企業で最も一般的な方式です。",
        "diagram": null
      },
      {
        "heading": "攻撃手法と対策（SQLインジェクション、XSS、フィッシング等）",
        "body": "サイバー攻撃の手口を知ることは、防御の第一歩です。SQLインジェクションは、Webフォームなどの入力欄にSQL文（データベース操作命令）を注入して、データベースを不正に操作する攻撃です。アンケートの自由記入欄に「データベースの全データを表示しろ」と書くようなものです。対策はプレースホルダ（パラメータ化クエリ）の使用やエスケープ処理です。クロスサイトスクリプティング（XSS）は、Webページに悪意のあるスクリプト（プログラム）を埋め込み、閲覧者のブラウザで実行させる攻撃です。掲示板の投稿に仕掛けた罠のようなものです。対策は入力値のサニタイジング（無害化）です。フィッシングは、実在の企業を装った偽メールや偽サイトでパスワードやクレジットカード情報を騙し取る攻撃です。本物そっくりの銀行のATMに見せかけた偽ATMのようなものです。対策はURLの確認、HTTPS通信の確認、不審なメールへの注意です。DDoS攻撃は、大量のアクセスでサーバをダウンさせる攻撃で、お店に大量の人を送り込んで営業妨害するイメージです。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "共通鍵暗号",
        "definition": "暗号化と復号に同じ鍵を使う方式。高速だが鍵配送問題がある。AESが代表的。",
        "analogy": "同じ鍵で施錠・解錠する家の鍵。鍵をどうやって安全に相手に渡すかが課題です。"
      },
      {
        "term": "公開鍵暗号",
        "definition": "公開鍵（暗号化用）と秘密鍵（復号用）のペアを使う方式。鍵配送問題を解決。RSAが代表的。",
        "analogy": "南京錠方式。開いた南京錠（公開鍵）は誰にでも渡せるが、鍵（秘密鍵）は自分だけが持っています。"
      },
      {
        "term": "ディジタル署名",
        "definition": "公開鍵暗号を応用し、データの送信者の本人確認と改ざん検出を行う技術。",
        "analogy": "実印の押印。本人しか持っていない印鑑（秘密鍵）で押したので、誰が送ったか証明できます。"
      },
      {
        "term": "認証局(CA)",
        "definition": "公開鍵の所有者を証明するディジタル証明書を発行する信頼された第三者機関。",
        "analogy": "役所の窓口。身分証明書（ディジタル証明書）を発行して「この人は本物です」と保証してくれます。"
      },
      {
        "term": "ハッシュ関数",
        "definition": "任意の長さのデータから固定長のハッシュ値を生成する一方向関数。改ざん検出に使用される。",
        "analogy": "指紋のようなもの。データの「指紋」を取って、後で同じ指紋かどうか確認すれば改ざんを検出できます。"
      },
      {
        "term": "SQLインジェクション",
        "definition": "入力値にSQL文を注入してデータベースを不正操作する攻撃手法。",
        "analogy": "アンケートの自由記入欄に「金庫を開けろ」と書いて、うっかりその指示が実行されてしまう状況です。"
      },
      {
        "term": "XSS",
        "definition": "クロスサイトスクリプティング。Webページに悪意のあるスクリプトを埋め込み、閲覧者のブラウザで実行させる攻撃。",
        "analogy": "掲示板の投稿に罠を仕掛け、読んだ人のパソコンで悪さをするウイルス付き手紙のようなものです。"
      },
      {
        "term": "フィッシング",
        "definition": "実在の組織を装った偽メールや偽サイトで個人情報を詐取するソーシャルエンジニアリング攻撃。",
        "analogy": "銀行員を装った詐欺電話。本物そっくりに見せかけて、パスワードやカード番号を聞き出します。"
      },
      {
        "term": "ファイアウォール",
        "definition": "ネットワーク境界で不正な通信をブロックするセキュリティ装置。",
        "analogy": "マンションのオートロック。許可された人（通信）だけを通し、不審者（不正アクセス）を遮断します。"
      }
    ],
    "relatedQuestions": ["q-secb-001", "q-secb-002", "q-secb-003", "q-secb-004", "q-secb-005"],
    "difficulty": "medium"
  }
]
