[
  {
    "sectionId": "tech-basic-theory",
    "category": "テクノロジ系",
    "chapter": "基礎理論",
    "title": "基礎理論",
    "overview": {
      "analogy": "基礎理論は、コンピュータの世界の「算数」のようなものです。私たちが日常で10進数（0〜9の数字）を使うように、コンピュータは2進数（0と1だけ）で計算しています。また、論理的な判断（AかつB、AまたはB）もコンピュータの思考の基本です。これらを理解すれば、コンピュータがどうやって情報を扱っているか見えてきます。",
      "summary": "基礎理論では、コンピュータ内部でのデータ表現（2進数・16進数）、論理演算（AND・OR・NOT・XOR）、確率・統計の基礎知識を学びます。これらはITのすべての分野の土台となる知識です。"
    },
    "content": [
      {
        "heading": "2進数・16進数と基数変換",
        "body": "私たちは普段10進数（0〜9の10種類の数字）を使っていますが、コンピュータの内部では2進数（0と1の2種類だけ）で情報を扱っています。これは、コンピュータが電気のON（1）とOFF（0）の2つの状態しか区別できないからです。例えるなら、部屋の電気スイッチのようなものです。1つのスイッチでは「点いている」か「消えている」の2通りしか表せませんが、8つのスイッチを組み合わせれば256通りの状態を表現できます。この1つのスイッチに相当するのが「ビット（bit）」で、8ビットをまとめたものが「バイト（byte）」です。16進数は、2進数の4桁を1桁で表す便利な記法です。0〜9の数字とA〜Fのアルファベットを使い、例えば2進数の「1111」は16進数の「F」になります。基数変換とは、10進数を2進数に変えたり、その逆を行ったりする計算のことです。10進数の「13」は2進数では「1101」、16進数では「D」と表されます。",
        "diagram": null
      },
      {
        "heading": "論理演算（AND, OR, NOT, XOR）",
        "body": "論理演算は、「はい（1）」と「いいえ（0）」の組み合わせで結果を出す計算です。日常生活の判断に例えるとわかりやすくなります。AND（論理積）は「AかつB」です。遊園地のアトラクションで「身長130cm以上」AND「年齢10歳以上」のように、両方の条件を満たすときだけ「はい」になります。OR（論理和）は「AまたはB」です。「現金またはクレジットカードで支払える」のように、どちらか一方でも満たせば「はい」です。NOT（否定）は「Aではない」です。「雨ではない＝晴れ」のように、結果をひっくり返します。XOR（排他的論理和）は「AかBのどちらか一方だけ」です。じゃんけんで「グーかパーのどちらか一方だけ出した人が勝ち」のように、両方同じだと「いいえ」になります。これらの演算は、コンピュータの回路設計やプログラミングの条件分岐で広く使われています。",
        "diagram": null
      },
      {
        "heading": "確率・統計の基礎",
        "body": "確率とは、ある出来事が起こる可能性を数値で表したものです。サイコロを振って1が出る確率は1/6（約16.7%）です。情報処理では、通信エラーの発生確率やシステム障害の予測などに確率の考え方を使います。統計では、データの特徴を数値で把握します。代表的な指標として、平均値（全データの合計÷個数）、中央値（データを順に並べた真ん中の値）、最頻値（最もよく出現する値）があります。例えば、テストの点数が{60, 70, 80, 80, 90}の場合、平均値は76点、中央値は80点、最頻値は80点です。分散と標準偏差はデータのばらつきを表す指標で、値が大きいほどデータが散らばっていることを意味します。これらの統計知識は、システムの性能評価やデータ分析の基本になります。",
        "diagram": null
      },
      {
        "heading": "符号理論とデータ表現",
        "body": "コンピュータで数値を表す方法にはいくつかの約束事があります。負の数を表す方法として「2の補数」があります。これは、ある数のビットを全部反転させて1を足す方法です。例えるなら、時計で「3時間前」を表すのに「-3」と書く代わりに「9時間後（12-3=9）」と表すようなものです。小数を表す方法としては「浮動小数点数」があります。これは科学的な表記法（例：3.14 × 10の2乗 = 314）のコンピュータ版です。「仮数部」が有効数字を、「指数部」が小数点の位置を表します。文字の表現には文字コードを使います。ASCIIは英数字を7ビットで表す基本的なコードで、Unicodeは世界中の文字を統一的に表すコード体系です。また、データの誤りを検出する仕組みとして「パリティチェック」があります。これはデータに1ビットの検査用ビットを付け加え、1の数が偶数か奇数かをチェックする方法です。手紙に封印をするように、データが途中で壊れていないか確認できます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "2進数",
        "definition": "0と1の2種類の数字だけで数を表す記数法。コンピュータ内部のデータ表現の基本。",
        "analogy": "電気のスイッチのON/OFFだけで数を数えるようなものです。スイッチ8個（8ビット）あれば0〜255まで表せます。"
      },
      {
        "term": "16進数",
        "definition": "0〜9とA〜Fの16種類の記号で数を表す記数法。2進数4桁を1桁で表せるため、コンピュータ分野で広く使われる。",
        "analogy": "2進数の長い数字を短くまとめる「省略記法」です。住所を郵便番号で短く表すのと似ています。"
      },
      {
        "term": "論理演算",
        "definition": "真（1）と偽（0）の値に対してAND, OR, NOT, XORなどの演算を行うこと。",
        "analogy": "日常の判断を「はい」「いいえ」で組み合わせること。「傘を持つか？」は「雨が降っている AND 外出する」で判断するようなものです。"
      },
      {
        "term": "ビット",
        "definition": "情報の最小単位。0か1のいずれかの値を取る。",
        "analogy": "電気のスイッチ1個分。ON（1）かOFF（0）かの2つの状態だけを表します。"
      },
      {
        "term": "バイト",
        "definition": "8ビットをひとまとめにした単位。1バイトで0〜255の値（256通り）を表現できる。",
        "analogy": "スイッチ8個を1セットにしたもの。アルファベット1文字を表すのにちょうどよい大きさです。"
      },
      {
        "term": "浮動小数点",
        "definition": "小数を「仮数部×基数の指数部乗」の形式で表現する方法。非常に大きな数や小さな数を効率的に扱える。",
        "analogy": "科学の授業で使う「3.0×10の8乗」のような書き方のコンピュータ版です。"
      },
      {
        "term": "補数",
        "definition": "ある数と足し合わせると桁上がりする数のこと。2の補数表現はコンピュータで負の数を表すのに使われる。",
        "analogy": "時計で「3時間前」を「9時間後」と同じと考えるようなものです（12-3=9）。"
      }
    ],
    "relatedQuestions": ["q-basic-001", "q-basic-002", "q-basic-003", "q-basic-004", "q-basic-005"],
    "difficulty": "hard"
  }
]
