[
  {
    "sectionId": "tech-computer-components",
    "category": "テクノロジ系",
    "chapter": "コンピュータ構成要素",
    "title": "コンピュータ構成要素",
    "overview": {
      "analogy": "コンピュータの構成要素を理解するには、人間の体に例えるとわかりやすいです。CPU（プロセッサ）は脳にあたり、計算や判断を行います。メモリは作業机で、今使っているデータを広げておく場所です。ハードディスクは本棚で、大量のデータを長期保存します。これらが連携して、コンピュータは動いています。",
      "summary": "コンピュータはCPU（中央処理装置）、メモリ（主記憶装置）、入出力デバイス、補助記憶装置などで構成されます。CPUの命令実行サイクル、メモリの階層構造、各種インタフェースの仕組みを理解することが重要です。"
    },
    "content": [
      {
        "heading": "CPUの仕組み（プロセッサ、命令実行サイクル）",
        "body": "CPU（Central Processing Unit）は、コンピュータの「頭脳」です。プログラムの命令を1つずつ読み取り、解釈し、実行します。CPUの動作は「命令フェッチ→命令解読→データ読み出し→実行→結果格納」というサイクルを繰り返します。料理に例えると、レシピを読む（フェッチ）→何をするか理解する（解読）→材料を取り出す（データ読み出し）→調理する（実行）→お皿に盛る（格納）というサイクルです。CPUの内部にはレジスタという超高速な小さな記憶領域があり、計算に必要なデータを一時的に保持します。クロック周波数（例：3.5GHz）はCPUの動作速度を表し、1秒間に35億回の処理サイクルを実行できることを意味します。パイプラインは、複数の命令を流れ作業のように並行処理する技術です。工場の組み立てラインのように、1つの命令が実行中に次の命令の解読を始めることで効率を上げます。",
        "diagram": null
      },
      {
        "heading": "メモリの種類と階層（主記憶、キャッシュ、補助記憶）",
        "body": "コンピュータのメモリには、速度とコストのトレードオフに基づく「階層構造」があります。最も速いのはCPU内のレジスタで、次にキャッシュメモリ、主記憶装置（RAM）、補助記憶装置（HDD/SSD）の順に遅くなりますが、容量は逆に大きくなります。この関係は、作業の道具に例えるとわかりやすいです。レジスタはポケット（すぐ取り出せるが入る量が少ない）、キャッシュは引き出し（よく使うものを入れておく）、主記憶は作業机（今の作業に必要なものを広げる）、補助記憶は倉庫（大量に保管できるが取り出しに時間がかかる）です。主記憶にはDRAM（安価で大容量だが定期的にリフレッシュが必要）が使われ、キャッシュにはSRAM（高速だが高価）が使われます。キャッシュメモリは、CPUと主記憶の速度差を埋めるバッファです。よく使うデータをキャッシュに置くことで、CPUの待ち時間を減らします。",
        "diagram": null
      },
      {
        "heading": "入出力デバイスとインタフェース",
        "body": "入出力デバイスは、人間とコンピュータをつなぐ「窓口」です。入力デバイス（キーボード、マウス、スキャナ等）は人間の指示をコンピュータに伝え、出力デバイス（ディスプレイ、プリンタ、スピーカ等）はコンピュータの結果を人間に見せます。これらのデバイスとコンピュータ本体をつなぐ規格がインタフェースです。USB（Universal Serial Bus）は最も普及した汎用インタフェースで、キーボード、マウス、外付けHDDなど様々なデバイスを接続できます。HDMI（High-Definition Multimedia Interface）は映像と音声を1本のケーブルで伝送する規格です。Bluetooth は無線でデバイスを接続する近距離通信技術で、イヤホンやキーボードなどに使われます。バスとは、CPU・メモリ・デバイス間でデータをやり取りするための共通の通信路です。道路に例えると、バス幅（ビット数）は車線の数、バスクロックは制限速度に相当します。車線が多く速度が速いほど、一度に大量のデータを運べます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "CPU",
        "definition": "中央処理装置。プログラムの命令を解釈・実行するコンピュータの中核部品。",
        "analogy": "コンピュータの「脳」。与えられた指示を理解し、計算や判断を行う司令塔です。"
      },
      {
        "term": "レジスタ",
        "definition": "CPU内部にある超高速で小容量の記憶領域。演算中のデータや命令アドレスを一時保持する。",
        "analogy": "料理人のすぐ手の届く場所に置いた調味料。取り出すのが一番速いが、置ける量はわずかです。"
      },
      {
        "term": "キャッシュメモリ",
        "definition": "CPUと主記憶の間に置かれる高速メモリ。頻繁にアクセスするデータを保持し、処理速度を向上させる。",
        "analogy": "よく読む本を机の上に出しておくこと。本棚まで取りに行く手間が省けて、作業が速くなります。"
      },
      {
        "term": "主記憶装置",
        "definition": "CPUが直接アクセスできるメモリ（RAM）。プログラムやデータを一時的に保持する。電源を切ると内容が消える。",
        "analogy": "作業机の上のスペース。広い机なら多くの書類を広げて同時に作業できますが、帰宅（電源OFF）すると片付けられます。"
      },
      {
        "term": "バス",
        "definition": "コンピュータ内部でCPU、メモリ、デバイス間を接続し、データを転送するための共通伝送路。",
        "analogy": "コンピュータ内部の「高速道路」。データバス（荷物を運ぶ車線）、アドレスバス（行き先を示す標識）、制御バス（信号機）から構成されます。"
      },
      {
        "term": "クロック周波数",
        "definition": "CPUの動作速度を示す指標。単位はHz（ヘルツ）で、1秒間の処理サイクル数を表す。",
        "analogy": "メトロノームの速さ。テンポが速い（周波数が高い）ほど、1秒間に多くの動作をこなせます。"
      },
      {
        "term": "パイプライン",
        "definition": "CPU内で複数の命令を段階的に並行処理する技術。命令の実行効率を大幅に向上させる。",
        "analogy": "工場の流れ作業（ベルトコンベア）。1つの製品が組み立て中でも、次の製品の部品取り付けを同時に進められます。"
      },
      {
        "term": "DRAM",
        "definition": "Dynamic RAM。主記憶装置に使われるメモリ。安価で大容量だが、定期的なリフレッシュ（再書き込み）が必要。",
        "analogy": "ホワイトボードのようなもの。たくさん書けるが、時間が経つと薄くなるので定期的に書き直す必要があります。"
      },
      {
        "term": "SRAM",
        "definition": "Static RAM。キャッシュメモリに使われる高速メモリ。リフレッシュ不要だが高価で大容量化が難しい。",
        "analogy": "付箋のようなもの。貼ったらすぐ読めるし消えないが、たくさん貼るにはコストがかかります。"
      }
    ],
    "relatedQuestions": ["q-comp-001", "q-comp-002", "q-comp-003", "q-comp-004", "q-comp-005"],
    "difficulty": "medium"
  }
]
