[
  {
    "sectionId": "tech-db-normalization",
    "category": "テクノロジ系",
    "chapter": "データベース",
    "title": "正規化",
    "overview": {
      "analogy": "正規化とは、散らかった部屋を整理整頓するようなものです。洋服はクローゼットに、本は本棚に、食器は食器棚にと、種類ごとに分けて収納すれば、探し物がすぐに見つかり、同じものを二重に買ってしまうこともなくなります。データベースの正規化も同じで、データを適切に分類・整理することで、重複や矛盾をなくし、効率的に管理できるようにします。",
      "summary": "正規化とは、リレーショナルデータベースにおいてデータの冗長性（重複）を排除し、データの整合性を保つためにテーブル構造を最適化する手法です。第1正規形から第3正規形までの段階的なルールに従ってテーブルを分割していきます。正規化を適切に行うことで、データの更新時異常（挿入異常・更新異常・削除異常）を防ぐことができます。"
    },
    "content": [
      {
        "heading": "正規化はなぜ必要か",
        "body": "データベースに情報を保存するとき、何も考えずにひとつの大きな表にすべてのデータを詰め込むと、さまざまな問題が発生します。例えば、ある顧客の住所が変わったとき、その顧客に関するすべての行を修正しなければなりません（更新異常）。また、まだ注文をしていない新規顧客を登録しようとしても、注文情報がないと行を作れない場合があります（挿入異常）。さらに、ある注文を削除したら、その顧客の情報まで一緒に消えてしまうこともあります（削除異常）。これらの問題を「更新時異常」と呼びます。正規化は、テーブルを適切に分割してこれらの異常を防ぎ、データの一貫性を保つための手法です。正規化を行うことで、データの管理が容易になり、ストレージの無駄遣いも減らすことができます。",
        "diagram": null
      },
      {
        "heading": "第1正規形・第2正規形・第3正規形",
        "body": "正規化は段階的に行います。第1正規形（1NF）は、すべてのセル（マス目）にひとつの値だけが入っている状態です。例えば、「電話番号」の欄に複数の番号をカンマ区切りで入れるのではなく、1つのセルに1つの番号だけを格納します。繰り返し項目を排除した状態が第1正規形です。第2正規形（2NF）は、第1正規形を満たしたうえで、主キーの一部だけに依存するデータ（部分関数従属）を別テーブルに分離した状態です。例えば、「注文番号＋商品コード」が主キーの場合、「商品名」は商品コードだけで決まるので、商品テーブルとして分離します。第3正規形（3NF）は、第2正規形を満たしたうえで、主キー以外の列に依存するデータ（推移的関数従属）を別テーブルに分離した状態です。例えば、顧客テーブルの中に「都道府県」と「地方名」があった場合、地方名は都道府県から決まるので、別テーブルに切り出します。基本情報技術者試験では、主に第3正規形までが出題範囲となります。",
        "diagram": null
      },
      {
        "heading": "SQL基礎と正規化の関係",
        "body": "正規化によってテーブルが分割されると、必要なデータを取得するためにSQL（構造化問い合わせ言語）を使ってテーブルを結合（JOIN）する必要があります。SQLの基本操作は、データの検索（SELECT）、挿入（INSERT）、更新（UPDATE）、削除（DELETE）の4つです。正規化されたテーブルからデータを取り出すときは、SELECT文でJOINを使って複数のテーブルを関連付けます。例えば、注文テーブルと顧客テーブルを顧客IDで結合することで、「どの顧客がどの注文をしたか」を一覧表示できます。正規化はテーブル数が増えるため結合処理が増えますが、データの整合性が保たれるという大きなメリットがあります。試験では、正規化の概念を理解したうえで、適切なSQLを書けるかが問われます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "第1正規形",
        "definition": "テーブル内のすべてのセルがひとつの値（原子値）のみを持ち、繰り返し項目が存在しない状態のこと。",
        "analogy": "引き出しの中に1つのものだけを入れるルールです。靴下と下着を同じ引き出しにごちゃ混ぜにせず、1つの引き出しには1種類のものだけを入れて整理するイメージです。"
      },
      {
        "term": "第2正規形",
        "definition": "第1正規形を満たし、かつ主キーの一部にのみ依存する列（部分関数従属）を別テーブルに分離した状態のこと。",
        "analogy": "学校の名簿を考えてみてください。「クラス番号＋出席番号」で生徒を特定しますが、「担任の先生の名前」はクラス番号だけで決まります。このような情報をクラステーブルとして独立させるのが第2正規形です。"
      },
      {
        "term": "第3正規形",
        "definition": "第2正規形を満たし、かつ主キー以外の列に依存する列（推移的関数従属）を別テーブルに分離した状態のこと。",
        "analogy": "住所録で「郵便番号→都道府県→地方」と芋づる式に決まる情報を考えてみてください。「地方」は「都道府県」から決まるので、都道府県と地方の対応は別の表にまとめたほうが管理しやすいですね。これが第3正規形の考え方です。"
      },
      {
        "term": "主キー",
        "definition": "テーブル内の各行を一意に識別するための列（または列の組み合わせ）。NULL値は許されず、重複も許されない。",
        "analogy": "学校の学籍番号のようなものです。すべての生徒に異なる番号が割り振られているので、番号を言えばどの生徒かを確実に特定できます。同じ番号の生徒は絶対にいません。"
      },
      {
        "term": "外部キー",
        "definition": "他のテーブルの主キーを参照する列のこと。テーブル間のリレーションシップ（関連）を定義するために使用される。",
        "analogy": "図書カードに書かれた本の管理番号のようなものです。図書カード自体には本の詳細情報はありませんが、管理番号をたどれば書庫にある本の情報にたどり着けます。この「管理番号」が外部キーの役割です。"
      }
    ],
    "relatedQuestions": ["q-db-001", "q-db-002", "q-db-003", "q-db-004", "q-db-005"],
    "difficulty": "medium"
  }
]
