[
  {
    "sectionId": "tech-hi-multimedia",
    "category": "テクノロジ系",
    "chapter": "ヒューマンインタフェースとマルチメディア",
    "title": "ヒューマンインタフェースとマルチメディア",
    "overview": {
      "analogy": "ヒューマンインタフェース（HI）は、人間とコンピュータの「会話の仕方」を決めるものです。わかりやすいアプリは「初めて来たお客さんでも迷わない、看板や案内が丁寧なお店」のようなものです。マルチメディアは、文字だけでなく画像・音声・動画を組み合わせた表現技術で、テレビやYouTubeの映像を支える裏側の技術です。",
      "summary": "ヒューマンインタフェースではGUI設計、ユーザビリティ、アクセシビリティの原則を学びます。マルチメディアでは画像（JPEG、PNG）、音声（MP3）、動画（MPEG）の仕組みとデータ量の計算方法を理解します。"
    },
    "content": [
      {
        "heading": "GUI設計の基本原則とユーザビリティ",
        "body": "GUI（Graphical User Interface）は、アイコンやボタンなどの視覚的な要素を使ってコンピュータを操作するインタフェースです。良いGUIは「初めて使う人でも直感的に操作できる」ことが大切です。ユーザビリティ（使いやすさ）の評価基準として、ヤコブ・ニールセンの5つの指標があります。学習しやすさ（初回でもすぐ使える）、効率性（慣れると素早く操作できる）、記憶しやすさ（久しぶりでも思い出せる）、エラーの少なさ（間違いにくい）、満足度（使って心地よい）です。例えばスマホのアプリで「戻る」ボタンが常に同じ位置にあるのは、学習しやすさと記憶しやすさの原則に従っています。また、重要な操作の前に確認ダイアログを表示するのは、エラー防止の原則です。UIデザインでは、色、配置、フォントサイズなどを工夫して、ユーザーの操作を自然に導くことが求められます。",
        "diagram": null
      },
      {
        "heading": "ユニバーサルデザインとアクセシビリティ",
        "body": "ユニバーサルデザインは「誰でも使えるデザイン」の考え方です。年齢、障害の有無、文化の違いに関係なく、すべての人が使いやすいことを目指します。駅のエレベーターや自動ドアは、車椅子の人だけでなく、ベビーカーを押す人やお年寄りにとっても便利です。同じ考え方をITにも適用したのがアクセシビリティ（情報へのアクセスのしやすさ）です。Webアクセシビリティでは、視覚障害のある方のために画像に代替テキスト（alt属性）を付ける、色覚多様性に配慮して色だけで情報を伝えない、キーボードだけでも操作できるようにする、といった配慮が必要です。JIS X 8341-3やWCAG（Web Content Accessibility Guidelines）が国際的な基準になっています。情報バリアフリーやデジタルデバイド（情報格差）の解消も、現代のIT社会で重要なテーマです。",
        "diagram": null
      },
      {
        "heading": "マルチメディア技術（画像・音声・動画の処理とファイル形式）",
        "body": "マルチメディアの基本は、アナログ情報をデジタルに変換する技術です。画像は、小さな点（ピクセル）の集まりで表現されます。解像度（例：1920×1080）はピクセルの数を表し、色深度（例：24ビット）は1ピクセルで表現できる色数を示します。24ビットなら約1677万色を表せます。画像形式として、JPEGは写真向けの圧縮形式（非可逆圧縮：一部の情報を捨てて小さくする）、PNGはイラスト向け（可逆圧縮：元通りに復元できる）、GIFはアニメーション対応（256色まで）です。音声は「サンプリング→量子化→符号化」の手順でデジタル化します。サンプリング周波数（例：44.1kHz）は1秒間に何回音を測定するか、量子化ビット数（例：16ビット）は音の大きさをどれだけ細かく記録するかを表します。CDの音質は44.1kHz×16ビット×2チャンネルで、1秒あたり約1.41Mbpsのデータ量です。MP3はこれを約1/10に圧縮します。動画はMPEGが標準規格で、フレーム間の差分だけを記録する「フレーム間予測」で圧縮します。パラパラ漫画で、全ページ描く代わりに前のページから変わった部分だけ描くイメージです。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "GUI",
        "definition": "Graphical User Interface。アイコンやウィンドウなどのグラフィック要素を用いた視覚的な操作インタフェース。",
        "analogy": "レストランの写真付きメニュー。文字だけのメニュー（CUI）より、写真があった方が選びやすいのと同じです。"
      },
      {
        "term": "ユーザビリティ",
        "definition": "ソフトウェアやシステムの使いやすさ。効率性、学習しやすさ、エラーの少なさなどで評価する。",
        "analogy": "お店の「居心地の良さ」。看板がわかりやすく、商品が見つけやすく、レジがスムーズなお店は、ユーザビリティが高いです。"
      },
      {
        "term": "アクセシビリティ",
        "definition": "年齢や障害の有無に関わらず、すべての人が情報やサービスにアクセスできる度合い。",
        "analogy": "建物のバリアフリー設計。スロープやエレベーターがあれば、車椅子の人もお年寄りも利用できます。"
      },
      {
        "term": "ユニバーサルデザイン",
        "definition": "できるだけ多くの人が利用可能なように、最初から配慮して設計すること。",
        "analogy": "自動ドア。障害者のためだけでなく、荷物を持った人、子供連れ、誰にとっても便利な設計です。"
      },
      {
        "term": "JPEG",
        "definition": "写真やグラデーションの多い画像に適した非可逆圧縮の画像フォーマット。",
        "analogy": "写真のフィルム現像。元のフィルムから少し画質を落として小さく焼き増しする感じです。一度圧縮すると完全には元に戻りません。"
      },
      {
        "term": "PNG",
        "definition": "可逆圧縮の画像フォーマット。透過表示に対応し、イラストやロゴに適している。",
        "analogy": "真空パックの保存食。圧縮しても開封すれば元通りの品質に戻ります。"
      },
      {
        "term": "MP3",
        "definition": "人間の耳に聞こえにくい音を間引くことで音声データを圧縮するフォーマット。",
        "analogy": "音楽CDの曲を「聞こえない部分」をカットして約1/10に小さくしたもの。普通に聞く分にはほぼ同じ音質です。"
      },
      {
        "term": "解像度",
        "definition": "画像を構成するピクセル（画素）の数。横×縦で表され、値が大きいほど精細な画像になる。",
        "analogy": "モザイクタイルの細かさ。タイルが小さい（解像度が高い）ほど、なめらかで精密な絵になります。"
      },
      {
        "term": "色深度",
        "definition": "1ピクセルの色を表現するためのビット数。24ビットなら約1677万色を表現できる。",
        "analogy": "色鉛筆の本数。12色セットより128色セットの方が、より繊細な色使いができるのと同じです。"
      },
      {
        "term": "サンプリング",
        "definition": "アナログ信号を一定間隔で測定してデジタルデータに変換すること。周波数が高いほど高品質。",
        "analogy": "パラパラ漫画のコマ数。コマ数（サンプリング回数）が多いほど、なめらかな動きを表現できます。"
      }
    ],
    "relatedQuestions": ["q-hi-001", "q-hi-002", "q-hi-003", "q-hi-004", "q-hi-005"],
    "difficulty": "easy"
  }
]
