[
  {
    "sectionId": "tech-network-protocol",
    "category": "テクノロジ系",
    "chapter": "ネットワーク",
    "title": "通信プロトコル（TCP/IP）",
    "overview": {
      "analogy": "通信プロトコルとは、人と人が会話するときのルールに似ています。手紙を送るときは、封筒に宛先と差出人を書き（IPアドレス）、郵便番号で届け先を特定し（ポート番号）、届いたかどうか確認する（TCP）という手順を踏みますよね。インターネットの通信も同じように、データを届けるための決まった手順やルールがあり、これを「プロトコル」と呼びます。",
      "summary": "TCP/IPは、インターネット通信の基盤となるプロトコル群（通信規約の集まり）です。4つの階層（アプリケーション層、トランスポート層、インターネット層、ネットワークインタフェース層）に分かれており、それぞれの層が役割を担うことで、異なるコンピュータ同士が正しくデータをやり取りできる仕組みになっています。HTTP、DNS、SMTPなどの主要プロトコルはアプリケーション層に属します。"
    },
    "content": [
      {
        "heading": "TCP/IPの4層モデル",
        "body": "TCP/IPモデルは、ネットワーク通信を4つの層に分けて整理した仕組みです。一番上の「アプリケーション層」は、Webブラウザやメールソフトなど、ユーザーが直接使うソフトウェアが通信する層です。HTTP（Web閲覧）、SMTP（メール送信）、DNS（名前解決）などのプロトコルが動作します。次の「トランスポート層」は、データを確実に届けるための層です。TCP（信頼性のある通信）とUDP（高速だが信頼性は低い通信）が代表的なプロトコルです。3番目の「インターネット層」は、データの行き先を決めてルーティング（経路選択）を行う層で、IPプロトコルが中心的な役割を果たします。一番下の「ネットワークインタフェース層」は、実際にケーブルやWi-Fiを通じてデータを電気信号や電波として送受信する層です。この4つの層がそれぞれの役割を担当することで、複雑なネットワーク通信が実現されています。",
        "diagram": null
      },
      {
        "heading": "主要プロトコルの役割（HTTP, DNS, SMTP）",
        "body": "インターネットでよく使われる代表的なプロトコルを見ていきましょう。HTTP（HyperText Transfer Protocol）は、Webページを閲覧するためのプロトコルです。ブラウザでURLを入力すると、HTTPを使ってWebサーバにリクエスト（要求）を送り、サーバからHTMLなどのデータをレスポンス（応答）として受け取ります。HTTPSはHTTPに暗号化（SSL/TLS）を加えた安全な通信方式です。DNS（Domain Name System）は、ドメイン名（例: www.example.com）をIPアドレス（例: 192.168.1.1）に変換するプロトコルです。人間にとって覚えやすいドメイン名を、コンピュータが理解できるIPアドレスに「翻訳」する電話帳のような役割を果たします。SMTP（Simple Mail Transfer Protocol）は、電子メールを送信するためのプロトコルです。メールの受信にはPOP3やIMAPが使われますが、送信側はSMTPが担当します。これらのプロトコルは基本情報技術者試験で頻出のため、それぞれの役割をしっかり覚えておきましょう。",
        "diagram": null
      },
      {
        "heading": "IPアドレスとポート番号",
        "body": "IPアドレスとポート番号は、ネットワーク上の通信相手を特定するために不可欠な情報です。IPアドレスは、ネットワーク上の各機器（コンピュータやサーバなど）に割り振られた住所のようなものです。IPv4では「192.168.1.1」のように4つの数字をドットで区切った形式で表され、約43億個のアドレスが使えます。しかし、インターネットの普及でアドレスが不足してきたため、より多くのアドレスを扱えるIPv6（例: 2001:0db8::1）への移行が進んでいます。ポート番号は、同じコンピュータ内のどのサービス（アプリケーション）宛ての通信かを区別するための番号です。IPアドレスが「建物の住所」だとすると、ポート番号は「部屋番号」にあたります。代表的なポート番号として、HTTP（80番）、HTTPS（443番）、SMTP（25番）、DNS（53番）などがあります。通信は「IPアドレス＋ポート番号」のセットで宛先が完全に特定されます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "TCP",
        "definition": "Transmission Control Protocolの略。データの送受信を信頼性高く行うためのプロトコル。データの到達確認や順序制御を行う。",
        "analogy": "書留郵便のようなものです。届いたかどうかを確認してくれるので、大切な書類（データ）を確実に届けたいときに使います。届かなかった場合は再送してくれます。"
      },
      {
        "term": "IP",
        "definition": "Internet Protocolの略。ネットワーク上のデータの送り先を決め、パケットを目的地まで届けるためのプロトコル。",
        "analogy": "郵便配達の仕組みそのものです。手紙（データ）に書かれた宛先住所（IPアドレス）を見て、郵便局（ルータ）を経由しながら届け先まで届ける役割を担います。"
      },
      {
        "term": "HTTP",
        "definition": "HyperText Transfer Protocolの略。Webブラウザとサーバの間でWebページのデータをやり取りするためのプロトコル。",
        "analogy": "レストランでの注文のようなものです。お客さん（ブラウザ）がメニューを見て料理を注文し（リクエスト）、キッチン（サーバ）が料理を作ってテーブルに届ける（レスポンス）という一連のやり取りがHTTPです。"
      },
      {
        "term": "DNS",
        "definition": "Domain Name Systemの略。ドメイン名をIPアドレスに変換（名前解決）するための仕組み。",
        "analogy": "電話帳のようなものです。友達の名前（ドメイン名）は覚えていても電話番号（IPアドレス）は覚えていないので、電話帳（DNS）で名前から番号を調べてから電話をかけます。"
      },
      {
        "term": "ポート番号",
        "definition": "コンピュータ上で動作する複数のサービスを区別するための番号。0から65535までの値を取る。",
        "analogy": "大きなオフィスビルの部屋番号のようなものです。ビルの住所（IPアドレス）だけでは何階のどの部屋に届けたいかわからないので、部屋番号（ポート番号）を指定して届け先を特定します。"
      }
    ],
    "relatedQuestions": ["q-net-001", "q-net-002", "q-net-003", "q-net-004", "q-net-005"],
    "difficulty": "medium"
  }
]
