[
  {
    "sectionId": "tech-security-basics",
    "category": "テクノロジ系",
    "chapter": "セキュリティ",
    "title": "情報セキュリティの基礎",
    "overview": {
      "analogy": "情報セキュリティとは、自分の家を守ることに似ています。家には鍵をかけ（機密性）、大切なものが壊されないようにし（完全性）、いつでも出入りできるようにする（可用性）必要があります。インターネット上の情報も同じように、悪意のある人から守り、正しい状態を保ち、必要なときにいつでも使えるようにすることが大切です。",
      "summary": "情報セキュリティとは、情報資産を脅威から保護するための考え方や技術の総称です。基本的な3要素として機密性（Confidentiality）、完全性（Integrity）、可用性（Availability）があり、これらを「CIA」と呼びます。脅威と脆弱性の関係を理解し、ファイアウォールなどの防御策を学ぶことが基本情報技術者試験の重要なポイントです。"
    },
    "content": [
      {
        "heading": "脅威・脆弱性・リスクの関係",
        "body": "情報セキュリティを理解するうえで、まず「脅威」「脆弱性」「リスク」の3つの概念を整理しましょう。脅威とは、情報資産に被害を与える可能性のある要因のことです。例えば、コンピュータウイルス、不正アクセス、自然災害などが脅威にあたります。脆弱性とは、システムや運用上の弱点のことです。ソフトウェアのバグ、設定ミス、パスワードの使い回しなどが脆弱性の例です。そしてリスクとは、脅威が脆弱性を突いて実際に被害が発生する可能性のことです。日常生活で例えると、泥棒（脅威）が鍵のかかっていない窓（脆弱性）から侵入して被害が起きる可能性（リスク）という関係になります。リスクを小さくするには、脆弱性を減らす（窓に鍵をかける）か、脅威を遠ざける（防犯カメラを設置する）対策が必要です。",
        "diagram": null
      },
      {
        "heading": "機密性・完全性・可用性（CIA）",
        "body": "情報セキュリティの3大要素は「CIA」と呼ばれ、すべてのセキュリティ対策の基本となります。機密性（Confidentiality）とは、許可された人だけが情報にアクセスできる状態を保つことです。例えば、自分の日記を他人に読まれないようにすることが機密性の確保です。技術的にはパスワード認証や暗号化がこれにあたります。完全性（Integrity）とは、情報が正確で改ざんされていない状態を保つことです。例えば、銀行の預金残高が勝手に書き換えられないようにすることです。デジタル署名やハッシュ関数が完全性を守る技術です。可用性（Availability）とは、必要なときにいつでも情報やシステムを利用できる状態を保つことです。例えば、ATMが24時間使える状態を維持することが可用性の確保です。冗長構成やバックアップがこれを支えます。",
        "diagram": null
      },
      {
        "heading": "ファイアウォールの仕組み",
        "body": "ファイアウォールは、ネットワーク上の不正な通信を遮断するためのセキュリティ装置です。名前の由来は「防火壁」で、火事のときに炎の広がりを防ぐ壁のように、外部からの不正アクセスを防ぎます。ファイアウォールは主に「パケットフィルタリング」という方法で通信を制御します。これは、ネットワークを流れるデータ（パケット）の送信元や送信先のIPアドレス、ポート番号などの情報をチェックし、あらかじめ設定されたルールに基づいて通信を許可または拒否する仕組みです。例えるなら、マンションの受付で訪問者の身分証を確認し、許可された人だけを通すようなものです。企業ネットワークでは、社内ネットワーク（信頼できるゾーン）とインターネット（信頼できないゾーン）の間にファイアウォールを設置し、外部からの攻撃を防ぎます。また、DMZ（非武装地帯）と呼ばれる中間ゾーンにWebサーバなどを配置し、外部公開と内部保護を両立する構成もよく使われます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "機密性",
        "definition": "許可された者だけが情報にアクセスできる状態を確保すること。情報セキュリティのCIAの「C」にあたる。",
        "analogy": "自分だけが知っている日記の鍵のようなものです。鍵を持っている人だけが日記を読むことができ、他の人には内容を見られないようにします。"
      },
      {
        "term": "完全性",
        "definition": "情報が正確であり、不正に改ざんされていない状態を確保すること。情報セキュリティのCIAの「I」にあたる。",
        "analogy": "封筒に入った手紙のようなものです。届いた手紙の封が破られていなければ、中身が途中で書き換えられていないと信頼できます。"
      },
      {
        "term": "可用性",
        "definition": "必要なときにいつでも情報やシステムを利用できる状態を確保すること。情報セキュリティのCIAの「A」にあたる。",
        "analogy": "24時間営業のコンビニのようなものです。いつ行っても開いていて、必要なものを買うことができる状態が「可用性が高い」ということです。"
      },
      {
        "term": "脆弱性",
        "definition": "システムやソフトウェアに存在するセキュリティ上の弱点や欠陥のこと。攻撃者に悪用される可能性がある。",
        "analogy": "家の壁にできたヒビのようなものです。普段は問題ないかもしれませんが、強い雨風（脅威）が来たときにそこから水が入ってきてしまう弱い部分です。"
      },
      {
        "term": "ファイアウォール",
        "definition": "ネットワークの境界に設置され、通信の許可・拒否を制御するセキュリティ装置。パケットフィルタリングなどの技術を用いる。",
        "analogy": "マンションのオートロックと受付のようなものです。訪問者（通信）が来たときに、住人の許可がある人だけを通し、怪しい人は入れないようにする仕組みです。"
      }
    ],
    "relatedQuestions": ["q-sec-001", "q-sec-002", "q-sec-003", "q-sec-004", "q-sec-005"],
    "difficulty": "medium"
  }
]
