[
  {
    "sectionId": "tech-software-hardware",
    "category": "テクノロジ系",
    "chapter": "ソフトウェア・ハードウェア",
    "title": "ソフトウェアとハードウェア",
    "overview": {
      "analogy": "コンピュータを動かすには、ハードウェア（体）とソフトウェア（心）の両方が必要です。ハードウェアがいくら高性能でも、OS（オペレーティングシステム）というソフトウェアがなければ、ただの金属の箱です。OSは、ホテルのフロント係のように、様々なお客さん（プログラム）の要望を整理して、部屋（メモリ）や設備（CPU）を効率的に割り当てます。",
      "summary": "OSはプロセス管理・メモリ管理・ファイルシステムなどの機能を提供し、ハードウェアを効率的に管理します。ミドルウェアやOSSの概念、ハードウェアの基礎（論理回路・組み込みシステム）も重要な学習範囲です。"
    },
    "content": [
      {
        "heading": "OSの役割（プロセス管理、メモリ管理、ファイルシステム）",
        "body": "OS（Operating System）は、コンピュータの「管理人」です。主な役割は3つあります。プロセス管理では、CPUの実行時間を複数のプログラムに振り分けます。例えるなら、料理番組で1人のシェフが複数の料理を同時進行するように、CPUが短い時間で次々とプログラムを切り替えて処理します（タイムシェアリング）。プロセスの中でさらに細かく分けた実行単位をスレッドと呼びます。メモリ管理では、限られたメモリを効率的にプログラムに配分します。仮想記憶は、ハードディスクの一部をメモリの代わりに使う技術で、物理メモリ以上の容量を扱えます。ページングは仮想記憶を固定サイズのブロック（ページ）に分割して管理する方式です。ファイルシステムは、データをファイルとフォルダで階層的に管理する仕組みです。パソコンのデスクトップでフォルダを開いてファイルを探す操作の裏側で、OSがディスク上の物理的な場所を管理しています。",
        "diagram": null
      },
      {
        "heading": "ミドルウェアとオープンソースソフトウェア",
        "body": "ミドルウェアは、OSとアプリケーションの間に位置するソフトウェアで、共通的な機能を提供します。マンションに例えると、OSが建物の基礎（電気・水道）で、アプリケーションが各部屋の家具なら、ミドルウェアはエレベーターや共用ロビーなどの共用設備です。代表的なミドルウェアには、データベース管理システム（DBMS）、Webサーバ（Apache、Nginx）、アプリケーションサーバなどがあります。オープンソースソフトウェア（OSS）は、ソースコードが公開されており、自由に利用・改変・再配布できるソフトウェアです。代表例としてLinux（OS）、MySQL/PostgreSQL（データベース）、Apache（Webサーバ）などがあります。OSSにはGPL、MIT、Apacheなどのライセンスがあり、それぞれ利用条件が異なります。GPLは改変したソフトもGPLで公開する義務があり（コピーレフト）、MITは緩い条件で自由に使えます。",
        "diagram": null
      },
      {
        "heading": "ハードウェアの基礎（論理回路、組み込みシステム）",
        "body": "論理回路は、コンピュータの最も基本的な部品で、論理演算を電気信号で実現します。AND回路（2つの入力が両方1のとき出力が1）、OR回路（どちらかが1なら出力が1）、NOT回路（入力を反転）が基本の3つです。これらを組み合わせてNAND、NOR、XOR回路も作れます。日常に例えると、AND回路は「2つの鍵を両方回さないと開かない金庫」、OR回路は「どちらかのスイッチを押せば動くドアベル」です。加算器や記憶回路（フリップフロップ）もこれらの基本回路の組み合わせで作られます。組み込みシステムは、家電製品や自動車などに内蔵された専用のコンピュータシステムです。炊飯器のマイコン、エアコンの温度制御、自動車のエンジン制御などが例です。パソコンとは違い、特定の用途に特化しており、リアルタイム性（決められた時間内に処理を完了すること）が求められるケースが多いです。IoT（モノのインターネット）の普及により、組み込みシステムの重要性はますます高まっています。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "OS",
        "definition": "オペレーティングシステム。ハードウェアを管理し、アプリケーションに共通の実行環境を提供する基本ソフトウェア。",
        "analogy": "ホテルのフロント係。お客さん（プログラム）の要望を聞いて、部屋（メモリ）や設備（CPU）を効率的に手配します。"
      },
      {
        "term": "プロセス",
        "definition": "実行中のプログラムのこと。CPUの実行単位であり、メモリ空間やファイルなどのリソースが割り当てられる。",
        "analogy": "レストランで受け付けた注文1つ1つ。それぞれに調理台のスペースや材料が割り当てられます。"
      },
      {
        "term": "スレッド",
        "definition": "プロセス内の軽量な実行単位。1つのプロセスが複数のスレッドを持ち、並行処理ができる。",
        "analogy": "1つの注文（プロセス）を複数の調理人（スレッド）で分担して同時に作るイメージです。"
      },
      {
        "term": "仮想記憶",
        "definition": "補助記憶装置の一部を主記憶の拡張として利用する技術。物理メモリ以上の空間をプログラムに提供できる。",
        "analogy": "作業机が狭い時に、横の棚にも書類を置いて、必要なものだけ机に載せ替える方法です。"
      },
      {
        "term": "ページング",
        "definition": "仮想記憶を固定サイズのブロック（ページ）に分割して管理する方式。必要なページだけ主記憶に読み込む。",
        "analogy": "辞書を全ページ机に広げるのではなく、今見ているページだけ開いておく方法です。"
      },
      {
        "term": "ファイルシステム",
        "definition": "補助記憶装置上のデータをファイルとディレクトリの階層構造で管理する仕組み。",
        "analogy": "書類をフォルダに分類してキャビネットに保管する整理方法。階層的に分けることで目的の書類を見つけやすくなります。"
      },
      {
        "term": "論理回路",
        "definition": "AND、OR、NOTなどの論理演算を電気信号で実現する電子回路。コンピュータの基本構成要素。",
        "analogy": "スイッチの組み合わせ。AND回路は2つのスイッチが両方ONのときだけ電気が通る直列回路です。"
      },
      {
        "term": "AND回路",
        "definition": "2つの入力が両方1のときだけ出力が1になる論理回路。論理積を実現する。",
        "analogy": "2つの鍵を両方回さないと開かない金庫。片方だけでは開きません。"
      },
      {
        "term": "OR回路",
        "definition": "2つの入力のうち少なくとも1つが1なら出力が1になる論理回路。論理和を実現する。",
        "analogy": "どちらかのドアベルを押せば鳴るインターホン。どちらを押しても反応します。"
      },
      {
        "term": "OSS",
        "definition": "オープンソースソフトウェア。ソースコードが公開され、自由に利用・改変・再配布できるソフトウェア。",
        "analogy": "レシピが公開されている料理。誰でも作れるし、自分流にアレンジして他の人に教えることもできます。"
      }
    ],
    "relatedQuestions": ["q-sw-001", "q-sw-002", "q-sw-003", "q-sw-004", "q-sw-005"],
    "difficulty": "medium"
  }
]
