[
  {
    "sectionId": "tech-system-components",
    "category": "テクノロジ系",
    "chapter": "システム構成要素",
    "title": "システム構成要素",
    "overview": {
      "analogy": "システム構成は、お店の運営に例えるとわかりやすいです。1人のスタッフ（サーバ1台）で対応するより、複数のスタッフで分担（分散処理）した方が効率的です。また、もし1人が休んでも他のスタッフがカバーできるよう、バックアップ体制（冗長構成）を整えることが重要です。システムの稼働率は「営業時間のうち実際にお店が開いている割合」です。",
      "summary": "システム構成要素では、クライアントサーバシステム、仮想化技術、システムの信頼性指標（稼働率・MTBF・MTTR）、冗長構成について学びます。システムをどう構成すれば安定して効率的に動くかを理解します。"
    },
    "content": [
      {
        "heading": "クライアントサーバシステムと3層アーキテクチャ",
        "body": "クライアントサーバシステムとは、サービスを要求する側（クライアント）とサービスを提供する側（サーバ）に分けたシステム構成です。レストランに例えると、お客さん（クライアント）が注文を出し、厨房（サーバ）が料理を作って提供するイメージです。3層アーキテクチャは、この仕組みをさらに3つの役割に分けたものです。プレゼンテーション層（ウェイター：お客さんとのやり取り）、アプリケーション層（シェフ：注文に基づいた調理）、データ層（食材庫：材料の管理）です。このように役割を分けることで、それぞれを独立して改善・交換できるメリットがあります。Webアプリケーションでは、ブラウザ（プレゼンテーション層）、Webサーバ/アプリケーションサーバ（アプリケーション層）、データベースサーバ（データ層）という構成が一般的です。",
        "diagram": null
      },
      {
        "heading": "仮想化技術（サーバ仮想化、コンテナ）",
        "body": "仮想化とは、1台の物理的なコンピュータを複数の仮想的なコンピュータとして使う技術です。マンションの一室を仕切って複数の部屋として使うイメージです。サーバ仮想化では、ハイパーバイザという管理ソフトウェアが物理サーバのリソース（CPU、メモリ、ディスク）を仮想マシン（VM）に配分します。各VMは独立したOSを持ち、まるで別々のサーバのように動作します。コンテナは、さらに軽量な仮想化技術です。VMが「部屋ごとに壁と天井がある完全な個室」だとすると、コンテナは「パーティションで区切ったスペース」です。OSを共有するため起動が速く、リソースも少なくて済みます。Docker が代表的なコンテナ技術です。仮想化により、1台のサーバで複数のサービスを効率的に運用でき、コスト削減と柔軟な管理が実現できます。",
        "diagram": null
      },
      {
        "heading": "システムの信頼性と評価指標（稼働率、MTBF、MTTR）",
        "body": "システムの信頼性を評価する3つの重要な指標があります。MTBF（Mean Time Between Failures：平均故障間隔）は「故障と故障の間の平均稼働時間」です。車に例えると、修理してから次に故障するまでの平均走行距離です。この値が大きいほど壊れにくい（信頼性が高い）ことを意味します。MTTR（Mean Time To Repair：平均修復時間）は「故障を修理するのにかかる平均時間」です。車が故障してから修理完了までの平均時間です。この値が小さいほど、すぐ直る（保守性が高い）ことを意味します。稼働率は「システムが使える状態にある割合」で、稼働率 = MTBF ÷（MTBF + MTTR）で計算します。例えば、MTBF=990時間、MTTR=10時間なら、稼働率=990÷1000=0.99（99%）です。24時間営業のコンビニで「実際に営業している時間の割合」と考えてください。",
        "diagram": null
      },
      {
        "heading": "冗長構成（デュプレックス、デュアル）",
        "body": "冗長構成とは、システムの一部が故障しても全体が止まらないように、予備の機器やシステムを用意しておくことです。飛行機のエンジンが複数あるのと同じ考え方です。デュプレックスシステムは、主系と待機系の2台構成です。普段は主系だけが稼働し、故障したら待機系に切り替えます。ホットスタンバイ（待機系が常に起動済み）なら数秒で切り替わり、コールドスタンバイ（待機系は停止状態）なら切り替えに数分〜数十分かかります。デュアルシステムは、2台が同時に同じ処理を行い、結果を照合する構成です。1台が故障しても、もう1台で処理を継続できます。信頼性は非常に高いですがコストも高くなります。直列システムと並列システムでは稼働率の計算が異なります。直列は各部品の稼働率の積（0.9×0.9=0.81）、並列は1-（1-稼働率）の積（1-(0.1×0.1)=0.99）となり、並列構成の方が全体の稼働率が高くなります。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "クライアントサーバ",
        "definition": "サービスを要求するクライアントと、サービスを提供するサーバに分かれたシステム構成。",
        "analogy": "レストランでお客さん（クライアント）が注文し、厨房（サーバ）が料理を作る関係です。"
      },
      {
        "term": "稼働率",
        "definition": "システムが正常に動作している時間の割合。MTBF÷(MTBF+MTTR)で算出する。",
        "analogy": "24時間営業のコンビニが実際に営業できている時間の割合。99%なら1年のうち約3.65日だけ休業です。"
      },
      {
        "term": "MTBF",
        "definition": "Mean Time Between Failures（平均故障間隔）。故障と故障の間の平均動作時間。値が大きいほど信頼性が高い。",
        "analogy": "車の「修理してから次に壊れるまでの平均走行距離」。長いほど丈夫ということです。"
      },
      {
        "term": "MTTR",
        "definition": "Mean Time To Repair（平均修復時間）。故障を修理するのにかかる平均時間。値が小さいほど保守性が高い。",
        "analogy": "車が故障してから修理完了までの平均時間。短いほど、すぐ直せるということです。"
      },
      {
        "term": "フォールトトレラント",
        "definition": "システムの一部に障害が発生しても、全体としてはサービスを継続できる設計思想。",
        "analogy": "飛行機のエンジンが1基止まっても残りのエンジンで飛び続けられるような設計です。"
      },
      {
        "term": "負荷分散",
        "definition": "複数のサーバに処理を分散させて、1台あたりの負荷を軽減する技術。ロードバランサが振り分けを行う。",
        "analogy": "スーパーのレジが混んだら新しいレジを開ける（サーバ追加）ことで、お客さんの待ち時間を減らすのと同じです。"
      },
      {
        "term": "仮想化",
        "definition": "物理的なハードウェアリソースを論理的に分割・統合し、複数の仮想マシンとして利用する技術。",
        "analogy": "1つの大きな部屋をパーティションで区切って、複数の独立した作業スペースとして使うことです。"
      },
      {
        "term": "クラスタリング",
        "definition": "複数のコンピュータを連携させ、1つの大きなシステムとして機能させる技術。",
        "analogy": "リレー走のように、複数のランナー（サーバ）がチームとなって1つのレース（処理）を行うイメージです。"
      }
    ],
    "relatedQuestions": ["q-sys-001", "q-sys-002", "q-sys-003", "q-sys-004", "q-sys-005"],
    "difficulty": "medium"
  }
]
