[
  {
    "sectionId": "mgmt-dev-methodology",
    "category": "マネジメント系",
    "chapter": "開発技術",
    "title": "システム開発技術",
    "overview": {
      "analogy": "システム開発は、家を建てることに似ています。ウォーターフォールモデルは、設計図を完全に仕上げてから基礎工事、骨組み、内装と順番に進める伝統的な建て方です。一方、アジャイル開発は、まず小さな小屋を建ててから住みながら増改築していくような柔軟な方法です。どちらにも長所と短所があり、プロジェクトの性質に合わせて使い分けることが大切です。",
      "summary": "システム開発技術とは、ソフトウェアやシステムを計画的に作るための手法や考え方です。代表的な開発モデルとして、工程を順番に進めるウォーターフォールモデルと、短いサイクルで繰り返し開発するアジャイル開発があります。また、品質を確保するためのテスト技法も重要な要素です。基本情報技術者試験では、各開発モデルの特徴と適用場面、テストの種類と目的について問われます。"
    },
    "content": [
      {
        "heading": "ウォーターフォールモデルとV字モデル",
        "body": "ウォーターフォールモデルは、最も伝統的なシステム開発手法です。「滝（ウォーターフォール）」の水が上から下へ流れるように、要件定義、設計、実装（プログラミング）、テスト、運用という工程を順番に進めていきます。各工程が完了してから次の工程に進むのが原則で、前の工程に戻ること（手戻り）は基本的にしません。大規模プロジェクトや要件が明確なシステム開発に向いていますが、途中で仕様変更が発生すると対応が難しいという弱点があります。V字モデルは、ウォーターフォールモデルを発展させたもので、開発の各工程とテストの各工程を対応付けた形をしています。例えば、要件定義に対応するのがシステムテスト、基本設計に対応するのが結合テスト、詳細設計に対応するのが単体テストという関係になります。これにより、各工程で何をテストすべきかが明確になります。",
        "diagram": null
      },
      {
        "heading": "アジャイル開発とスクラム",
        "body": "アジャイル開発は、短い期間（通常1〜4週間）のサイクル（イテレーション）を繰り返しながらソフトウェアを少しずつ作り上げていく手法です。「アジャイル」は「俊敏な」という意味で、変化に素早く対応できることが最大の特徴です。顧客のフィードバックを頻繁に取り入れながら開発を進めるため、要件が変わりやすいプロジェクトや、完成形が最初から明確でないプロジェクトに適しています。スクラムは、アジャイル開発の具体的なフレームワーク（進め方のルール）のひとつです。開発チームは「スプリント」と呼ばれる1〜4週間の単位で作業を区切り、毎日短いミーティング（デイリースクラム）で進捗を共有します。プロダクトオーナー（何を作るか決める人）、スクラムマスター（チームを支援する人）、開発チームという3つの役割が定義されているのも特徴です。スクラムの利点は、問題を早期に発見でき、チーム全体で状況を把握しやすい点にあります。",
        "diagram": null
      },
      {
        "heading": "テスト技法の基本",
        "body": "システム開発において、テストは品質を確保するための最も重要な工程のひとつです。テストは大きく「ホワイトボックステスト」と「ブラックボックステスト」に分類されます。ホワイトボックステストは、プログラムの内部構造（ソースコード）を見ながら行うテストです。すべての命令が実行されるか（命令網羅）、すべての分岐条件が実行されるか（分岐網羅）などを確認します。プログラマ自身が行うことが多いテストです。ブラックボックステストは、プログラムの内部構造は考慮せず、入力と出力だけを見て正しく動作するかを確認するテストです。仕様書通りに動くかどうかを検証するため、利用者の視点に近いテストといえます。同値分割法（入力を有効・無効のグループに分けてテストする方法）や境界値分析（境界となる値を重点的にテストする方法）が代表的な技法です。また、テスト駆動開発（TDD）は、先にテストコードを書き、そのテストを通るように実際のコードを書いていく開発手法で、アジャイル開発でよく使われます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "ウォーターフォールモデル",
        "definition": "要件定義から運用まで、各工程を順番に1つずつ完了させながら進める開発手法。手戻りを前提としない。",
        "analogy": "料理のレシピ通りに上から順番に作るようなものです。まず材料を揃え、次に下ごしらえ、調理、盛り付けと順番に進めます。途中で「やっぱり違う料理にしよう」とは言えません。"
      },
      {
        "term": "アジャイル開発",
        "definition": "短いイテレーション（反復）を繰り返しながら、顧客のフィードバックを取り入れて段階的にシステムを構築していく開発手法の総称。",
        "analogy": "粘土で彫刻を作るようなものです。最初に大まかな形を作り、少しずつ細部を整えていきます。途中で「もう少し腕を長くしよう」と思ったら柔軟に修正できます。"
      },
      {
        "term": "V字モデル",
        "definition": "ウォーターフォールモデルの各開発工程に対して、対応するテスト工程を明確にした開発モデル。Vの字の左側が開発工程、右側がテスト工程。",
        "analogy": "建物の検査に例えると、設計段階で「基礎工事は震度7に耐えること」と決めたら、完成後に「震度7に耐えるか」を検査するという対応関係を最初から決めておくイメージです。"
      },
      {
        "term": "スクラム",
        "definition": "アジャイル開発のフレームワークのひとつ。スプリントと呼ばれる短い期間で開発を区切り、プロダクトオーナー・スクラムマスター・開発チームの3つの役割で進める。",
        "analogy": "ラグビーのスクラムが由来です。チーム全員が肩を組んで一丸となってゴールに向かうように、開発チームも密に連携しながら短期間で成果物を作り上げていきます。"
      },
      {
        "term": "テスト駆動開発",
        "definition": "Test-Driven Development（TDD）の略。実装の前にテストコードを書き、そのテストが通るように実装コードを書く開発手法。",
        "analogy": "試験問題を先に作ってから教科書を書くようなものです。「こういう問題に正しく答えられるようにする」という目標を先に設定してから、その目標を達成するための内容を作り上げていきます。"
      }
    ],
    "relatedQuestions": ["q-dev-001", "q-dev-002", "q-dev-003", "q-dev-004", "q-dev-005"],
    "difficulty": "easy"
  }
]
