[
  {
    "sectionId": "mgmt-project-management",
    "category": "マネジメント系",
    "chapter": "プロジェクトマネジメント",
    "title": "プロジェクトマネジメント",
    "overview": {
      "analogy": "プロジェクトマネジメントは、大きな旅行の計画を立てるようなものです。いつまでに何をするか、予算はいくらか、どんなリスクがあるかを事前に考え、旅行全体がスムーズに進むように管理します。計画通りにいかないときの対処法まで考えておくのがプロのやり方です。",
      "summary": "プロジェクトマネジメントとは、決められた期間・予算・品質でプロジェクトの目標を達成するための管理手法です。PMBOKというガイドに基づき、スコープ・スケジュール・コスト・リスクなどを体系的に管理します。基本情報技術者試験では、WBSやクリティカルパス、EVMなどの具体的な手法が頻出です。"
    },
    "content": [
      {
        "heading": "プロジェクトマネジメントとは（PMBOK概要）",
        "body": "プロジェクトマネジメントとは、ある目標を達成するために「人・お金・時間」をうまくやりくりする技術です。たとえば、文化祭でクラスの出し物を成功させるために、誰が何を担当するか決め、材料費を管理し、当日までのスケジュールを立てるのと同じです。\n\nこの分野で世界的に使われているガイドが「PMBOK（Project Management Body of Knowledge）」です。PMBOKは、プロジェクトを成功させるための知識を10の管理領域（スコープ、スケジュール、コスト、品質、資源、コミュニケーション、リスク、調達、ステークホルダー、統合）に整理しています。料理のレシピ本のように、「こういう場面ではこうするとうまくいく」という知恵がまとめられています。\n\nプロジェクトには必ず「始まり」と「終わり」があります。日常業務（ルーティンワーク）とは違い、一回限りの活動です。新しいシステムの開発や、新店舗のオープン準備などがプロジェクトの典型例です。プロジェクトマネージャ（PM）は、これらすべてを統括し、プロジェクトをゴールに導く責任者です。\n\nPMBOKでは、プロジェクトを「立ち上げ→計画→実行→監視・コントロール→終結」という5つのプロセスグループに分けて管理します。家を建てるときに、まず設計図を作り（計画）、実際に工事を始め（実行）、途中で品質をチェックし（監視）、最後に引き渡す（終結）のと同じ流れです。",
        "diagram": null
      },
      {
        "heading": "スコープ管理とWBS",
        "body": "スコープとは「プロジェクトでやるべき作業の範囲」のことです。引っ越しにたとえると、「荷造り・運搬・荷解き」はスコープに含まれますが、「新居のリフォーム」は含まれないといった線引きをすることです。このスコープをきちんと定義しないと、「あれもやってほしい、これもやってほしい」と際限なく要求が増える「スコープクリープ」という問題が発生します。\n\nスコープを管理するための代表的なツールがWBS（Work Breakdown Structure：作業分解構成図）です。WBSは、プロジェクト全体の作業を細かく分解して階層構造で表現したものです。たとえば「結婚式の準備」というプロジェクトなら、「会場手配」「招待状送付」「衣装選び」「料理選び」と大項目に分け、さらに「会場手配」を「候補リスト作成→見学→予約→契約」と細かく分解していきます。\n\nWBSの最下層の作業単位を「ワークパッケージ」と呼びます。ワークパッケージは、担当者に割り当てることができる具体的な作業の単位です。レストランのメニューでいえば、「前菜」「メイン」「デザート」という大きなカテゴリから、「シーザーサラダを作る」「ステーキを焼く」といった具体的な作業まで落とし込んだものです。\n\nWBSを作成することで、作業の抜け漏れを防ぎ、各作業の担当者・期間・コストを明確にできます。試験では「WBSの目的は何か」「WBSの最下層の要素を何と呼ぶか」といった問題がよく出題されます。WBSはスケジュールやコストの見積もりの基礎となる、プロジェクトマネジメントの土台と言えます。",
        "diagram": null
      },
      {
        "heading": "スケジュール管理（アローダイアグラム、クリティカルパス）",
        "body": "スケジュール管理とは、プロジェクトの各作業をいつ始めていつ終わらせるかを計画し、進捗を管理することです。夏休みの宿題計画を立てるのと同じで、「数学ドリルを7月中に終わらせ、読書感想文は8月前半に書く」というように、作業の順番と期間を決めます。\n\nスケジュール管理でよく使われるのがアローダイアグラム（PERT図）です。これは作業の順序関係を矢印（→）で表した図で、「Aの作業が終わらないとBの作業が始められない」といった依存関係を視覚的に示します。料理でいえば、「野菜を切る→炒める→盛り付ける」のように、順番が決まっている作業の流れを図にしたものです。\n\nアローダイアグラムの中で最も重要な概念が「クリティカルパス」です。クリティカルパスとは、プロジェクト全体で最も時間がかかる経路のことで、この経路上の作業が遅れると、プロジェクト全体が遅れます。たとえば、朝の支度で「シャワー（15分）→着替え（5分）→朝食（10分）」の30分コースと「洗顔（3分）→歯磨き（3分）」の6分コースがあれば、30分コースがクリティカルパスです。クリティカルパス上の作業には余裕（フロート）がゼロです。\n\nもう一つの代表的なツールがガントチャートです。ガントチャートは横軸に時間、縦軸に作業を配置した棒グラフのような図で、各作業の開始日・終了日・進捗状況を視覚的に把握できます。カレンダーに予定を書き込むイメージに近く、直感的に理解しやすいのが特徴です。\n\n試験では「アローダイアグラムからクリティカルパスを求める」計算問題が頻出します。各経路の所要日数を足し算して、最も長い経路を見つけることがポイントです。",
        "diagram": null
      },
      {
        "heading": "コスト管理とEVM（アーンドバリューマネジメント）",
        "body": "コスト管理とは、プロジェクトの予算を計画し、実際の支出を管理することです。家計簿をつけるのと同じで、「今月の食費は5万円まで」と予算を立て、実際の支出と比較して使いすぎていないかチェックします。\n\nコスト管理で重要な手法がEVM（Earned Value Management：アーンドバリューマネジメント）です。EVMは、プロジェクトの進捗とコストを同時に把握できる管理手法です。家のリフォームにたとえると、「予算100万円で、今日までに60万円分の工事が終わっているはずだが、実際には50万円分しか終わっておらず、しかも既に65万円使っている」というように、計画と実績のズレを数値で把握できます。\n\nEVMでは3つの基本指標を使います。PV（Planned Value：計画価値）は「今日までに完了しているはずの作業の予算」、EV（Earned Value：出来高）は「実際に完了した作業の予算上の価値」、AC（Actual Cost：実コスト）は「実際にかかった費用」です。PVが計画、EVが実績の進捗、ACが実際のお金の流れを表します。\n\nこれらの指標から、コスト差異（CV = EV - AC）とスケジュール差異（SV = EV - PV）を計算します。CVがマイナスなら予算オーバー、SVがマイナスならスケジュール遅延を意味します。さらに、CPI（コスト効率指数 = EV÷AC）が1未満ならコスト超過、SPI（スケジュール効率指数 = EV÷PV）が1未満なら遅延と判断できます。\n\n試験ではEVMの計算問題が出題されます。PV・EV・ACの3つの値が与えられて、コスト差異やスケジュール差異を求める問題が典型的です。「EVが基準」と覚えておくと、計算式を間違えにくくなります。",
        "diagram": null
      },
      {
        "heading": "リスクマネジメント",
        "body": "リスクマネジメントとは、プロジェクトで起こりうる問題をあらかじめ予測し、対策を準備しておくことです。旅行前に「雨が降ったらどうするか」「飛行機が遅延したらどうするか」と考えて、折りたたみ傘を持っていったり、余裕のあるスケジュールにしたりするのと同じです。\n\nリスクマネジメントのプロセスは「リスク特定→リスク分析→リスク対応計画→リスク監視」の順番で進めます。まず、どんなリスクがあるかを洗い出し（特定）、それぞれのリスクの発生確率と影響度を評価し（分析）、対策を考え（対応計画）、プロジェクト進行中に状況を見守ります（監視）。\n\nリスクへの対応策には4つのパターンがあります。「回避」はリスクの原因そのものをなくすこと（台風シーズンに旅行しない）、「軽減」は影響を小さくすること（保険に入る）、「転嫁」はリスクを他者に移すこと（外部委託する）、「受容」はリスクを受け入れること（起きたら対処する）です。\n\nリスクには「マイナスのリスク（脅威）」だけでなく「プラスのリスク（好機）」もあります。たとえば「円高になって海外からの調達コストが下がるかもしれない」というのはプラスのリスクです。プラスのリスクに対しては「活用」「強化」「共有」「受容」の対応策があります。\n\n試験ではリスクの対応戦略の分類や、リスク分析の手法について問われます。特に「回避・軽減・転嫁・受容」の4つの違いを具体例で理解しておくことが重要です。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "PMBOK",
        "definition": "プロジェクトマネジメントに関する知識を体系的にまとめた国際的なガイド。10の知識エリアと5つのプロセスグループで構成される。",
        "analogy": "プロジェクトを成功させるための「攻略本」のようなもの。料理でいうレシピ集にあたり、状況に応じた最適なやり方がまとめられている。"
      },
      {
        "term": "WBS",
        "definition": "Work Breakdown Structureの略。プロジェクトの作業を階層的に細分化した構成図。最下層の要素をワークパッケージと呼ぶ。",
        "analogy": "大掃除の「やることリスト」を部屋ごと、場所ごとに細かく分けたもの。「リビング→窓拭き→外側・内側」のように、作業を具体的なレベルまで分解する。"
      },
      {
        "term": "クリティカルパス",
        "definition": "プロジェクト全体で最も所要時間が長い経路。この経路上の作業が遅れると、プロジェクト全体の完了が遅れる。",
        "analogy": "朝の支度で一番時間がかかる工程のこと。シャワー→着替え→朝食の30分コースが最長なら、これがクリティカルパス。歯磨き3分を短縮しても出発時間は早まらない。"
      },
      {
        "term": "ガントチャート",
        "definition": "横軸に時間、縦軸に作業項目を配置し、各作業の期間を棒（バー）で表した図表。作業の開始・終了時期や進捗状況を視覚的に把握できる。",
        "analogy": "学校の時間割表に似た図。各授業（作業）がいつからいつまであるか一目でわかる。カレンダーに予定を色分けして書き込むイメージ。"
      },
      {
        "term": "EVM",
        "definition": "Earned Value Managementの略。PV（計画価値）・EV（出来高）・AC（実コスト）の3指標を使い、プロジェクトの進捗とコストを定量的に管理する手法。",
        "analogy": "ダイエットの管理表のようなもの。「今日までに3kg減のはず（PV）、実際は2kg減（EV）、でも食費は予定より多く使った（AC）」と、計画と実績のズレを数値で見える化する。"
      },
      {
        "term": "リスク",
        "definition": "プロジェクトの目標に影響を与える不確実な事象。マイナスの影響（脅威）だけでなく、プラスの影響（好機）も含む。対応策は回避・軽減・転嫁・受容の4種類。",
        "analogy": "天気予報の「降水確率」のようなもの。雨が降るかもしれない（リスク）から、傘を持っていく（軽減）か、屋内に変更する（回避）か、事前に決めておく。"
      },
      {
        "term": "スコープ",
        "definition": "プロジェクトで実施する作業の範囲。成果物として何を作り、何を作らないかを明確に定義する。範囲が不明確だとスコープクリープ（範囲の肥大化）が起きる。",
        "analogy": "テスト範囲のようなもの。「数学のテスト範囲は第3章まで」と決めないと、どこまで勉強すればいいかわからない。プロジェクトも「やること」と「やらないこと」を明確にする。"
      },
      {
        "term": "マイルストーン",
        "definition": "プロジェクトにおける重要な節目・中間目標。作業そのものではなく、ある時点での到達状態を示す。期間はゼロ（瞬間的な地点）として扱われる。",
        "analogy": "マラソンの給水ポイントや折り返し地点のようなもの。「ここまで来たら順調」と確認できるチェックポイント。旅行の「何時までに空港に着く」という中間目標にも似ている。"
      }
    ],
    "relatedQuestions": [
      "q-pm-001",
      "q-pm-002",
      "q-pm-003"
    ],
    "difficulty": "medium"
  }
]