[
  {
    "sectionId": "mgmt-service-management",
    "category": "マネジメント系",
    "chapter": "サービスマネジメントとシステム監査",
    "title": "サービスマネジメントとシステム監査",
    "overview": {
      "analogy": "ITサービスマネジメントは、ホテルの運営に似ています。お客様（利用者）に快適なサービスを提供するために、フロントデスク（サービスデスク）で問い合わせに対応し、設備トラブル（インシデント）が起きたら素早く修理し、サービスの品質基準（SLA）を守ります。システム監査は、そのホテルに抜き打ち検査が入るようなもので、ルール通りに運営されているかを第三者がチェックします。",
      "summary": "ITサービスマネジメントは、ITサービスを安定的かつ効率的に提供・管理するための体系的な手法です。ITILというフレームワークに基づき、インシデント管理・問題管理・変更管理などのプロセスでサービス品質を維持します。システム監査は、情報システムの信頼性・安全性・効率性を独立した立場から評価する活動です。"
    },
    "content": [
      {
        "heading": "ITサービスマネジメント（ITIL概要）",
        "body": "ITサービスマネジメントとは、企業や組織がITサービスを「安定して」「効率よく」提供し続けるための管理手法です。たとえば、社内のメールシステムやファイル共有サービスが突然止まったら、仕事に大きな影響が出ます。こうしたITサービスを24時間365日安定して動かし続けるのがITサービスマネジメントの役割です。\n\nITサービスマネジメントの世界標準的なフレームワーク（ベストプラクティス集）が「ITIL（Information Technology Infrastructure Library）」です。ITILは、ITサービスを効果的に管理するための考え方やプロセスをまとめたガイドブックです。レストランでいえば、接客マニュアル・衛生管理マニュアル・クレーム対応マニュアルなどを総合的にまとめた「運営の教科書」のようなものです。\n\nITILでは、サービスを「サービス戦略→サービス設計→サービス移行→サービス運用→継続的サービス改善」というライフサイクルで管理します。新しいサービスを企画し（戦略）、設計し（設計）、導入し（移行）、日々運用し（運用）、常に改善していく（改善）という一連の流れです。\n\nITサービスマネジメントの窓口となるのが「サービスデスク」です。サービスデスクは、利用者からの問い合わせやトラブル報告を一元的に受け付ける窓口で、ホテルのフロントデスクのような役割を果たします。「パスワードを忘れた」「プリンタが動かない」といった様々な問い合わせに対応し、適切な担当者に取り次ぎます。",
        "diagram": null
      },
      {
        "heading": "SLAとサービスレベル管理",
        "body": "SLA（Service Level Agreement：サービスレベル合意書）とは、ITサービスの提供者と利用者の間で取り決める「サービス品質の約束」です。携帯電話の契約にたとえると、「通信速度は最大○○Mbps」「月間稼働率99.9%以上」「故障時は4時間以内に復旧」といった具体的な数値で品質基準を明文化したものです。\n\nSLAを設定することで、サービス提供者は「何をどのレベルで提供すればよいか」が明確になり、利用者は「どの程度のサービスを期待できるか」を事前に把握できます。レストランの「注文から30分以内に提供、それを超えたらドリンク1杯無料」という約束のように、具体的で測定可能な基準を定めることがポイントです。\n\nサービスレベル管理では、SLAで定めた品質基準が守られているかを定期的にモニタリング（監視）し、達成状況をレポートします。もし基準を下回っている場合は、原因を分析して改善策を実施します。学校の成績管理に似ていて、目標点数（SLA）を設定し、テスト結果（実績）を確認し、足りなければ勉強方法を見直すという流れです。\n\nSLAに関連する概念として、SLM（Service Level Management：サービスレベル管理）があります。SLMはSLAの策定・合意・監視・改善を一連のプロセスとして管理する活動全体を指します。試験では「SLAに記載する内容は何か」「SLAの目的は何か」といった問題がよく出題されます。",
        "diagram": null
      },
      {
        "heading": "インシデント管理・問題管理・変更管理",
        "body": "ITILの中でも特に重要な3つのプロセスが、インシデント管理・問題管理・変更管理です。これらは相互に関連しながら、ITサービスの品質を維持する仕組みです。\n\nインシデント管理は、ITサービスの中断や品質低下（インシデント）が発生したとき、できるだけ早くサービスを復旧させることを目的としています。たとえば、社内メールが突然使えなくなった場合、原因究明よりもまず「メールを使えるようにする」ことを優先します。家の水道管が破裂したら、まず応急処置で水を止めるのと同じ考え方です。インシデント管理では、根本原因の解決よりも迅速な復旧を重視します。\n\n問題管理は、インシデントの根本原因を突き止め、再発を防止することを目的としています。インシデント管理が「応急処置」なら、問題管理は「根本治療」です。水道管が破裂した原因が老朽化なら、配管を全部交換するのが問題管理にあたります。同じインシデントが繰り返し発生する場合、問題管理によって根本原因を特定し、恒久的な対策を講じます。\n\n変更管理は、ITサービスや構成要素に対する変更を安全かつ計画的に実施するためのプロセスです。新しいソフトウェアの導入や設定変更など、システムに変更を加える際には、その変更がサービスに悪影響を与えないかを事前に評価し、承認を得てから実施します。病院で新しい治療法を導入する際に、安全性を十分に検証してから実施するのと同じ考え方です。\n\n試験では、この3つのプロセスの違い（特にインシデント管理と問題管理の違い）がよく問われます。「すぐに復旧させる」のがインシデント管理、「根本原因を解決する」のが問題管理と覚えておきましょう。",
        "diagram": null
      },
      {
        "heading": "システム監査と内部統制",
        "body": "システム監査とは、企業の情報システムが適切に運用されているかを、独立した第三者の立場からチェック・評価する活動です。学校でいえば「教育委員会の抜き打ち検査」のようなもので、授業が計画通りに行われているか、安全管理は適切かを外部の人が確認します。\n\nシステム監査で最も重要な原則が「独立性」です。監査人は、監査対象のシステムの開発や運用に関与していない人でなければなりません。自分で作ったテストを自分で採点するのでは公平性が保てないのと同じで、客観的な評価を行うために独立した立場が求められます。\n\nシステム監査では、主に「信頼性」「安全性」「効率性」の3つの観点からシステムを評価します。信頼性は「システムが正しく動くか」、安全性は「情報が漏れたり壊されたりしないか」、効率性は「無駄なくコストに見合った運用ができているか」を確認します。\n\n内部統制は、企業が健全に経営を行うために組織内部に設ける仕組みやルールのことです。会社のお金の管理で「経費の申請→上司の承認→経理の処理」というルールを設けることで、不正を防止するのが内部統制の一例です。IT分野での内部統制には、アクセス権限の管理やデータのバックアップ体制の整備などが含まれます。\n\nITガバナンスは、経営戦略に沿ってIT投資や活用を適切に管理・統制する仕組みです。内部統制がルールを守る仕組みであるのに対し、ITガバナンスはITを経営に役立てるための方針・体制づくりという、より広い概念です。試験では「システム監査人に求められる独立性とは何か」「内部統制の目的は何か」といった問題が出題されます。",
        "diagram": null
      }
    ],
    "keyTerms": [
      {
        "term": "ITIL",
        "definition": "ITサービスマネジメントのベストプラクティスをまとめた世界標準のフレームワーク。サービスのライフサイクル全体を体系的に管理する考え方を提供する。",
        "analogy": "ホテルや飲食店の「運営マニュアル全集」のようなもの。接客から設備管理、クレーム対応まで、うまくいくやり方を体系的にまとめたガイドブック。"
      },
      {
        "term": "SLA",
        "definition": "Service Level Agreementの略。サービス提供者と利用者の間で、サービスの品質水準（稼働率、応答時間など）を数値で定めた合意文書。",
        "analogy": "携帯電話の契約書に書かれている「通信速度○○Mbps保証」のようなもの。サービスの品質を具体的な数値で約束する契約。"
      },
      {
        "term": "インシデント管理",
        "definition": "ITサービスの中断や品質低下が発生した際に、できるだけ早くサービスを正常な状態に復旧させるプロセス。根本原因の解決よりも迅速な復旧を優先する。",
        "analogy": "急病人が出たときの「救急対応」のようなもの。まず症状を安定させること（復旧）が最優先で、病気の根本原因を調べるのは後回しにする。"
      },
      {
        "term": "問題管理",
        "definition": "インシデントの根本原因を特定し、再発防止策を講じるプロセス。インシデント管理が応急処置なら、問題管理は根本治療にあたる。",
        "analogy": "何度も水漏れが起きる家で、配管自体を交換する「根本修理」のようなもの。応急処置（インシデント管理）では解決しない根本原因を突き止めて対策する。"
      },
      {
        "term": "変更管理",
        "definition": "ITサービスや構成要素に変更を加える際に、リスクを最小限に抑えながら計画的に実施するプロセス。変更要求の評価・承認・実施・レビューを行う。",
        "analogy": "マンションのリフォームで、管理組合の承認を得てから工事するようなもの。勝手に壁を壊すと他の住人に迷惑がかかるので、事前に計画を提出して許可を得る。"
      },
      {
        "term": "サービスデスク",
        "definition": "ITサービスの利用者からの問い合わせやトラブル報告を一元的に受け付ける窓口。SPOC（Single Point of Contact：単一窓口）とも呼ばれる。",
        "analogy": "ホテルのフロントデスクのようなもの。部屋のエアコンが壊れた、タクシーを呼びたい、周辺の観光情報を知りたいなど、あらゆる要望を一つの窓口で受け付ける。"
      },
      {
        "term": "システム監査",
        "definition": "情報システムの信頼性・安全性・効率性を、独立した第三者の立場から客観的に評価・検証する活動。監査人の独立性が最も重要な原則。",
        "analogy": "レストランの衛生検査のようなもの。お店の人ではなく、保健所の検査員（第三者）が、衛生基準が守られているかを客観的にチェックする。"
      },
      {
        "term": "内部統制",
        "definition": "企業が業務の有効性・効率性、財務報告の信頼性、法令遵守、資産の保全を確保するために、組織内部に設ける仕組みやルール。",
        "analogy": "家庭の「お小遣い帳」や「レシート提出ルール」のようなもの。お金の使い方にルールを設けて、使いすぎや不正を防ぐ仕組み。"
      },
      {
        "term": "ITガバナンス",
        "definition": "経営戦略に沿ってIT投資や活用を適切に管理・統制するための仕組み。ITが経営目標の達成に貢献しているかを監視・評価する。",
        "analogy": "家庭の「教育方針」のようなもの。子供（IT）にどの塾に通わせるか（投資）、どんな習い事をさせるか（活用）を、家族の目標に合わせて計画的に管理する。"
      }
    ],
    "relatedQuestions": [
      "q-sm-001",
      "q-sm-002",
      "q-sm-003"
    ],
    "difficulty": "medium"
  }
]